Repository: cerha/pytis
Catalog: translations/pytis-x2go.*.po
Languages: cs

source: Failed creating desktop shortcut
cs: Chyba při vytváření zástupce na ploše

source: Shortcut created successfully.
cs: Zástupce úspěšně vytvořen.

source: Generate new SSH key pair
cs: Vygenerovat nový pár SSH klíčů

source: Change key passphrase
cs: Změnit heslo klíče

source: Upload public key to server
cs: Nahrát veřejný klíč na server

source: Send public key to admin
cs: Poslat veřejný klíč správci

source: Cleanup desktop shortcuts
cs: Pročistit zástupce na ploše

source: More actions...
cs: Další funkce...

source: Selected profile %s: Contacting server...
cs: Vybrán profil %s: Navazuji spojení se serverem...

source: Start session
cs: Spustit sezení

source: Create shortcut
cs: Vytvořit zástupce

source: Available profiles:
cs: Dostupné profily:

source: Terminating session: %s
cs: Ukončení sezení: %s

source: Session terminated: %s
cs: Sezení ukončeno: %s

source: Existing sessions:
cs: Stávající sezení:

source: Resume
cs: Obnovit

source: Terminate
cs: Ukončit

source: Start New Session
cs: Spustit nové sezení

source: Yes
cs: Ano

source: No
cs: Ne

source: Starting Pytis client.
cs: Spouštím Pytis klienta

source: Upgrade available
cs: Dostupná aktualizace

source: New Pytis client version available.
cs: Je dostupná nová verze Pytis klienta.

source: Current version: %s
cs: Aktuální verze: %s

source: New version: %s
cs: Nová verze: %s

source: Install?
cs: Nainstalovat?

source: Upgrade failed
cs: Aktualizace selhala

source: Upgrade finished
cs: Aktualizace dokončena

source: Pytis successfully upgraded. Restart the application.
cs: Pytis byl úspěšně aktualizován. Restartujte aplikaci.

source: Retrieving available sessions.
cs: Probíhá zjišťování dostupných sezení.

source: Select session
cs: Vyberte sezení

source: Resuming session: %s
cs: Obnova sezení: %s

source: Starting new session.
cs: Spuštění nového sezení.

source: Waiting for the application to come up...
cs: Čekám na naběhnutí aplikačního okna...

source: Select SSH key file
cs: Vyberte soubor SSH klíče

source: Key File:
cs: Soubor s klíčem:

source: Select
cs: Vyberte

source: Passphrase:
cs: Heslo:

source: Password:
cs: Heslo:

source: Public Key
cs: Veřejný klíč

source: Password
cs: Heslo

source: No supported SSH authentication method available.
cs: Není dostupná žádná podporovaná metoda SSH autentizace

source: Login name:
cs: Uživatelské jméno:

source: Log in
cs: Přihlášení

source: Cancel
cs: Zrušit

source: Passphrases don't match.
cs: Hesla neodpovídají.

source: Unallowed characters.
cs: Nepovolené znaky.

source: Passphrase too short (minimum is 10 characters).
cs: Heslo je příliš krátké (minimum je 10 znaků).

source: Passphrase too weak (use capitals and numbers).
cs: Heslo je příliš slabé (použijte velká písmena a číslice).

source: Repeat:
cs: Zopakujte:

source: Starting application
cs: Start aplikace

source: Exit
cs: Konec

source: Invalid session format
cs: Chybný formát sezení

source: No free port found for RPyC in the range %s-%s
cs: Nenalezen volný port pro RPyC v rozsahu %s-%s

source: Preparing X2Go session.
cs: Připravuji X2Go sezení.

source: Starting up X11 server.
cs: Startuji X11 server.

source: Starting up server connections.
cs: Navazuji serverová spojení.

source: Connecting to X2Go session.
cs: Připojuji se k X2Go sezení.

source: Unsupported broker protocol: %s
cs: Nepodporovaný protokol přístupu na broker: %s

source: Invalid URL: %s
cs: Neplatná URL adresa: %s

source: Retrieving supported authentication methods.
cs: Zjišťuji podporované metody autentizace.

source: Trying public key authentication.
cs: Zkouším autentizaci veřejným klíčem.

source: Trying password authentication.
cs: Zkouším autentizaci heslem.

source: Trying SSH Agent authentication.
cs: Zkouším autentizaci pomocí SSH agenta.

source: Trying Kerberos authentication.
cs: Zkouším autentizaci přes Kerberos.

source: Trying interactive authentication.
cs: Zkouším interaktivní autentizaci.

source: Connected successfully.
cs: Připojení proběhlo úspěšně.

source: Returned %d profile.
cs: Vrácen %d profil.

source: Couldn't connect to upgrade server.
cs: Nelze se připojit na aktualizační server.

source: Package unpacking failed.
cs: Selhalo rozbalení balíku.

source: Unable to find the scripts directory: %s
cs: Adresář skriptů nenalezen: %s

source: Confirm shortcuts removal
cs: Potvrďte smazání zástupců

source: The following desktop shortcuts are invalid.
cs: Následující zástupci na ploše jsou neplatní.

source: Press Ok to remove the checked items.
cs: Stiskem Ok smažte zaškrtnuté položky.

source: Name
cs: Název

source: %d shortcut removed succesfully.
cs: %d zástupce úspěšně smazán.

source: An existing key found: %s
cs: Stávající klíč nalezen: %s

source: Enter new key passphrase
cs: Zadejte nové heslo ke klíči

source: Keys created in directory: %s
cs: Klíče byly vytvořeny v adresáři: %s

source: Question
cs: Dotaz

source: Use your usual email application (Thunderbird, Outlook) to send the public key file as an attachment. Your public key file should have an extension '.pub' (e.g. id_rsa.pub) and it is located in the directory {}.
cs: Použijte svou běžnou poštovní aplikaci (Thunderbird, Outlook) k odeslání souboru s veřejným klíčem v příloze emailu. Váš soubor s veřejným klíčem by měl mít příponu '.pub' (např. id_rsa.pub) a měl by se nacházet v adresáři {}.
