Repository: cerha/pytis
Catalog: translations/pytis-data.*.po
Languages: cs

source: Access denied
cs: Neoprávněný přístup

source: Waiting for server recovery
cs: Čekám na zotavení serveru

source: Can't connect to database
cs: Nemohu se připojit do databáze

source: Database interface error
cs: Chyba v databázovém rozhraní

source: Database connection timeout
cs: Vypršel časový limit pro navázání databázového spojení

source: Database connection error
cs: Chyba databázového spojení

source: Database operational error
cs: Chyba databázové operace

source: Database internal error
cs: Interní databázová chyba

source: Database integrity violation
cs: Porušení integrity dat v databázi

source: Too many database connections
cs: Příliš mnoho databázových spojení

source: Database error
cs: Databázová chyba

source: Invalid user name or password
cs: Chybné uživatelské jméno nebo heslo

source: Method not implemented
cs: Volána neimplementovaná metoda

source: Invalid database counter value
cs: Chybná hodnota čítače z databáze

source: Wildcard matching not supported for values of type '%s'.
cs: Hvězdičkové výrazy nejsou podporovány pro hodnoty typu '%s'.

source: Empty value
cs: Prázdná hodnota

source: Invalid value
cs: Neplatná hodnota

source: Minimal value is %(minimum)s
cs: Minimální hodnota je %(minimum)s

source: Maximal value is %(maximum)s
cs: Maximální hodnota je %(maximum)s

source: Minimal size %(minlen)s not satisfied
cs: Nedodržena minimální velikost %(minlen)s

source: Maximal size %(maxlen)s exceeded
cs: Maximální velikost %(maxlen)s překročena

source: Lower range bound higher than the upper one
cs: Dolní hranice rozsahu je vyšší než horní

source: Not an integer
cs: Není to celé číslo

source: Invalid number
cs: Není to povolené číslo

source: Minimal length %(minlen)s characters not satisfied
cs: Nedodržena minimální délka %(minlen)s znaků

source: Maximal length %(maxlen)s characters exceeded
cs: Řetězec přesahuje maximální délku %(maxlen)s znaků

source: Please use mix of letters and non-letters in your password
cs: Použijte ve svém hesle kombinaci písmenných a nepísmenných znaků

source: Enter the password twice to eliminate typos
cs: Zadejte heslo dvakrát pro eliminování překlepů

source: Passwords don't match
cs: Kontrolní zadání hesla neodpovídá

source: Invalid MD5 hash
cs: Neplatná MD5 suma

source: Invalid format
cs: Neplatný formát

source: Invalid color format ('#RGB' or '#RRGGBB')
cs: Formát barvy neodpovídá ('#RGB' nebo '#RRGGBB')

source: Invalid inet address mask: %(mask)s
cs: Neplatná maska inet adresy: %(mask)s

source: Invalid inet address value %(addr)s
cs: Neplatná hodnota inet adresy: %(addr)s

source: Invalid date or time format
cs: Chybný formát data nebo času

source: Date outside the allowed range
cs: Datum mimo povolený rozsah

source: %d h
cs: %d hod

source: %d day
cs: %d den

source: less than 1 min
cs: méně než 1 min

source: Invalid boolean type input value
cs: Neplatná vstupní hodnota typu boolean

source: Invalid graphics format
cs: Neplatný grafický formát

source: Minimal pixel size %(minsize)s exceeded
cs: Minimální rozměr %(minsize)s pixelů nedodržen

source: Maximal pixel size %(maxsize)s exceeded
cs: Maximální rozměr %(maxsize)s pixelů překročen

source: Unsupported format %(format)s; valid formats: %(formats)s
cs: Nepodporovaný formát %(format)s; platné formáty: %(formats)s

source: Invalid hierarchical value format
cs: Chybný formát hierarchické hodnoty

source: One of hierarchical value items is too long
cs: Jedna z položek hierarchické hodnoty je příliš dlouhá

source: One of hierarchical value items contains invalid characters
cs: Jedna z položek hierarchické hodnoty obsahuje neplatné znaky

source: Not a JSON string
cs: Není JSON řetězec

source: Unsupported JSON value
cs: Nepodporovaná JSON hodnota

source: JSON value doesn't match schema definition
cs: JSON hodnota neodpovídá definici schematu

source: Such value already exists.
cs: Taková hodnota již existuje

source: unlimited
cs: neomezeno

source: You don't have priviledges to invoke the action '%s'. Please contact the access rights administrator.
cs: Nemáte oprávnění pro vyvolání akce '%s'. Kontaktujte prosím správce přístupových práv.
