Repository: cerha/pytis
Catalog: translations/pytis-wx.*.po
Languages: cs

source: The database connection was closed because of long inactivity.
cs: Databázové spojení bylo uzavřeno kvůli dlouhé neaktivitě.

source: Could not connect to SMTP server
cs: Připojení k SMTP serveru se nezdařilo

source: Recipient address refused
cs: Adresa příjemce odmítnuta

source: Sender address refused
cs: Adresa odesílatele odmítnuta

source: SMTP server disconnected
cs: Spojení se SMTP serverem ztraceno

source: Error by sending data
cs: Chyba při odesílání dat

source: Error by sending helo
cs: Chyba při odesílání HELO

source: Default printer setup failed. CUPS Python interface not present. Please, contact the system administrator.
cs: Nastavení výchozí tiskárny nemůže být provedeno. Pythonové rozhraní k CUPS nenalezeno. Kontaktujte, prosím, správce systému.

source: Printer Selection
cs: Výběr tiskárny

source: Choose the default printer:
cs: Zvolte výchozí tiskárnu:

source: Open %s "%s"
cs: Otevřít %s "%s"

source: form
cs: formulář

source: Run Form
cs: Spustit formulář

source: Form type
cs: Typ formuláře

source: Search string
cs: Vyhledávání řetězce

source: Specification name
cs: Název specifikace

source: Detected data type %(detected)s. Expected %(expected)s.
cs: Detekována data typu %(detected)s. Očekávám %(expected)s.

source: Invalid form class in startup forms:
cs: Neplatná třída ve formulářích ke spuštění při startu:

source: Restore forms
cs: Obnova formulářů

source: Restore these forms saved on last exit?
cs: Znovu otevřít formuláře uložené při posledním ukončení aplikace?

source: Opening form:
cs: Spouštím formulář:

source: Opening saved forms
cs: Automatické otevření uložených formulářů

source: Commands
cs: Příkazy

source: Help
cs: Nápověda

source: Password
cs: Heslo

source: Enter your password
cs: Zadejte heslo

source: Enter your login password for encryption keys management
cs: Zadejte své přihlašovací heslo, pro správu šifrovacích klíčů

source: Invalid password
cs: Chybné heslo

source: Enter the password to unlock the encryption area %s.
cs: Zadejte heslo pro odemčení šifrovací oblasti %s.

source: This is probably your old login password.
cs: Patrně se jedná o vaše staré přihlašovací heslo.

source: Encryption key password
cs: Heslo pro šifrovací klíč

source: Open the form (%s)
cs: Otevřít formulář (%s)

source: Clear
cs: Vymazat

source: Clear the menu of recent forms
cs: Vymazat menu posledně otevřených formulářů

source: Move left
cs: Přesunout vlevo

source: Move this tab one position left (or drag by mouse).
cs: Přesunout tuto záložku o jednu pozici vlevo (nebo přetáhněte myší).

source: Move right
cs: Přesunout vpravo

source: Move this tab one position right (or drag by mouse).
cs: Přesunout tuto záložku o jednu pozici vpravo (nebo přetáhněte myší).

source: Close
cs: Zavřít

source: Close the form in this tab.
cs: Uzavřít formulář v této záložce.

source: Activate previous tab
cs: Aktivovat předchozí záložku

source: Switch to the tab on left from the current tab.
cs: Přepnout do záložky vlevo od aktuální záložky.

source: Activate next tab
cs: Aktivovat následující záložku

source: Switch to the tab on right from the current tab.
cs: Přepnout do záložky vpravo od aktuální záložky.

source: Activate recently active tab
cs: Aktivovat posledně aktivní záložku

source: Allows cyclic switching between two most recently active tabs.
cs: Umožňuje cyklicky přepínat mezi dvěma posledně aktivními formuláři.

source: Can't exit when modal windows exist.
cs: Aplikaci není možné ukončit, pokud existuje modální okno.

source: Stopped...
cs: Zastaveno...

source: Opening form...
cs: Spouštím formulář...

source: Form "%s" found between open windows.
cs: Formulář "%s" nalezen mezi otevřenými okny.

source: Form creation failed: %s
cs: Formulář se nepodařilo vytvořit: %s

source: This operation requires remote client connection which is currently not available. You may try to repeat the operation once you see a green dot in the connection status indicator (at the bottom bar). The operation will be canceled now.
cs: Tato operace vyžaduje vzdálené klientské spojení, které je momentálně nedostupné. Můžete zkusit operaci zopakovat později, pokud uvidíte zelenou kontrolku indikátoru stavu spojení ve stavové řádce. Operace bude nyní zrušena.

source: Client version
cs: Verze klienta

source: Client OS
cs: OS klienta

source: Remote display
cs: Vzdálený displej

source: X2Go session ID
cs: ID sezení X2Go

source: X2Go version
cs: ID sezení X2Go

source: Local Python version
cs: Místní verze Pythonu

source: Remote Python version
cs: Vzdálená verze Pythonu

source: Local RPyC version
cs: Místní verze RPyC

source: Remote RPyC version
cs: Vzdálená verze RPyC

source: Running locally.
cs: Lokální spuštění.

source: Connected.
cs: Spojeno.

source: Error
cs: Chyba

source: Connection lost.
cs: Spojení ztraceno.

source: Last available: %s
cs: Naposledy k dispozici: %s

source: Connection not established.
cs: Spojení nebylo navázáno.

source: Not available
cs: Není k dispozici

source: Username: %s
cs: Uživatelské jméno: %s

source: Database name: %s
cs: Název databáze: %s

source: Database host: %s
cs: Databázový server: %s

source: List position
cs: Pozice v seznamu

source: User and database parameters
cs: Uživatel a databázové parametry

source: Remote communication status
cs: Stav vzdálené komunikace

source: Files of the required type
cs: Soubory požadovaného typu

source: All files
cs: Všechny soubory

source: Message
cs: Zpráva

source: Warning
cs: Varování

source: Question
cs: Otázka

source: Are you sure to delete the record permanently?
cs: Opravdu chcete záznam zcela vymazat?

source: Date
cs: Datum

source: This form doesn't allow insertion.
cs: Do tohoto formuláře nelze vkládat.

source: Record not found
cs: Záznam nenalezen

source: This form is read-only.
cs: Tento formulář je pouze pro čtení.

source: This form doesn't allow deletion.
cs: V tomto formuláři nelze mazat.

source: Running procedure...
cs: Spouštím proceduru...

source: Operation in progress
cs: Provádí se operace

source: Please wait...
cs: Čekejte prosím...

source: Unable to create temporary file: %s
cs: Nelze vytvořit pomocný soubor: %s

source: Viewer for '%s' (%s) not found.
cs: Prohlížeč pro '%s' (%s) nebyl nalezen.

source: MIME type for '%s' not found. Your system doesn't recognize the MIME type of this file.
cs: Váš systém nezná MIME typ tohoto souboru.

source: Print specification not found: {}
cs: Tisková sestava nenalezena: {}

source: Invalid use of identifier `data' in print specification. Maybe use `current_row' instead?
cs: Chybné použití identifikátoru `data' v tiskové sestavě. Možná jste místo něj chtěli použít `current_row'?

source: Opening form refused.
cs: Spuštění formuláře zamítnuto.

source: Access denied
cs: Přístup odepřen

source: Log in for database access
cs: Přihlášení pro přístup do databáze

source: Login
cs: Uživatelské jméno

source: Database error
cs: Databázová chyba

source: Try again?
cs: Zkusit znovu?

source: Recently opened forms
cs: Posledně otevřené formuláře

source: User interface settings
cs: Nastavení uživatelského rozhraní

source: Export settings
cs: Nastavení exportu

source: User interface handbook
cs: Příručka uživatelského rozhraní obecně

source: Open the user's manual describing work with the application in general
cs: Zobrazit uživatelskou příručku popisující ovládání aplikace

source: Help for the current form
cs: Nápověda k aktuálnímu formuláři

source: Open the detailed description of the current form in the help browser
cs: Zobrazit podrobnou nápovědu k aktuálnímu formuláři v prohlížeči nápovědy

source: Current form description
cs: Popis aktuálního formuláře

source: Display a brief description of the current form
cs: Zobrazit stručný popis aktuálního formuláře

source: Show aggregation functions menu
cs: Zobrazit menu agregačních funkcí

source: Show the menu of aggregation functions for the current form
cs: Zobrazit menu agregačních funkcí pro aktivní formulář

source: Show print menu
cs: Zobrazit tiskové menu

source: Show the menu of print reports for the current form
cs: Zobrazit menu tiskových sestav pro aktivní formulář

source: Jump to record
cs: Skok na záznam

source: Jump to record by row number
cs: Skok na záznam podle čísla řádku

source: Search
cs: Hledat

source: Search a record matching given conditions.
cs: Vyhledávat záznam podle zadaných podmínek.

source: Search next
cs: Hledat další

source: Search next record matching given conditions.
cs: Vyhledat následující záznam odpovídající zadaným podmínkám.

source: Search previous
cs: Hledat předchozí

source: Search previous record matching given conditions.
cs: Vyhledat předchozí záznam odpovídající zadaným podmínkám.

source: Search incrementally
cs: Hledat inkrementálně

source: Progressively search record by typing column value.
cs: Postupně vyhledávat záznam podle hodnoty políčka.

source: Sort
cs: Řadit

source: Define the terms of sorting records.
cs: Určit podmínky řazení záznamů.

source: Profile selection
cs: Výběr profilu

source: Shows the current profile and allows selection from predefined profiles.
cs: Zobrazuje aktivní profil a umožňuje výběr z ostatních předdefinovaných profilů.

source: Filter
cs: Filtrovat

source: Filter records matching given conditions.
cs: Filtrovat záznamy podle zadaných podmínek.

source: Unfilter
cs: Zrušit filtr

source: Cancel current filtering condition.
cs: Zrušit filtrování záznamů.

source: Edit record
cs: Upravit záznam

source: Open a form to edit the current record.
cs: Otevřít formulář pro úpravy aktuálního záznamu.

source: New record
cs: Nový záznam

source: Open a form to create a new record.
cs: Otevřít formulář pro vložení nového záznamu.

source: New record - copy
cs: Nový záznam - kopie

source: Create a new record by copying the values of the current record.
cs: Vložit nový záznam zkopírováním hodnot aktuálního záznamu.

source: Delete record
cs: Smazat záznam

source: Delete the current record.
cs: Smazat aktuální záznam.

source: Export to file
cs: Exportovat do souboru

source: Export form data into a file.
cs: Exportovat data formuláře do souboru.

source: Import from file
cs: Importovat ze souboru

source: Import data from a text file in CSV format.
cs: Importovat data z textového souboru ve formátu CSV.

source: Switch the active form
cs: Přepnout aktivní formulář

source: Switch between the top and the bottom form of a dual form.
cs: Přechod mezi horním a dolním formulářem duálního formuláře.

source: Switch the current keyboard layout
cs: Přepnout aktuální rozložení klávesnice.

source: Switch between keyboard layouts defined in configuration.
cs: Přepínat rozložení klávesnice podle možností definovaných v nastavení aplikace.

source: Switch splitter orientation
cs: Změnit orientaci rozdělění

source: Switch between horizontal and vertical arrangement of the main form and side form.
cs: Přepnout mezi vertikálním a horizontálním uspořádáním hlavního a vedlejšího formuláře.

source: Close form
cs: Uzavřít formulář

source: Close the current form window.
cs: Uzavřít okno aktuálního formuláře.

source: Cancel
cs: Zrušit

source: Yes
cs: Ano

source: No
cs: Ne

source: Abort
cs: Ukončit

source: Elapsed time:
cs: Uplynulý čas:

source: Estimated total time:
cs: Odhadovaný celkový čas:

source: Estimated remaining time:
cs: Odhadovaný zbývající čas:

source: Calendar
cs: Kalendář

source: Ignore
cs: Ignorovat

source: Try to continue as if nothing happened (may not work).
cs: Zkusit pokračovat jako by se nic nestalo (nemusí fungovat).

source: Exit application
cs: Ukončit aplikaci

source: Abort the operation and exit.
cs: Přerušit operaci a skončit.

source: Unhandled exception
cs: Neočekávaná chyba

source: Program Error
cs: Chyba programu

source: Unhandled exception caught. Please, use the button below to report the problem.
cs: Zachycena neošetřená chyba. Použijte, prosím, tlačítko níže k ohlášení problému.

source: Exception details
cs: Podrobnosti chyby

source: Your message (optional)
cs: Vaše zpráva (nepovinné)

source: Set your address in form "%s" to avoid being asked next time.
cs: Pokud svou adresu nastavíte ve formuláři "%s", nebudete již příště dotazováni.

source: Your email address:
cs: Vaše e-mailová adresa:

source: Send error report
cs: Poslat oznámení o chybě

source: Destination address not known. The configuration option `bug_report_address' must be set.
cs: Není známa cílová adresa. Je nutno nastavit konfigurační volbu `bug_report_address'.

source: The report has been sent successfully.
cs: Oznámení chyby bylo úspěšně odesláno.

source: Failed sending error report.
cs: Oznámení se nezdařilo odeslat.

source: Select
cs: Vybrat

source: Aggregated view parameters
cs: Parametry agregačního náhledu

source: Enter the name for saving the view, or leave empty, if you prefer not to save it.
cs: Zadejte název pod kterým se má náhled uložit, nebo ponechte prázdné, pokud náhled nechcete ukládat.

source: Title
cs: Název

source: Group by
cs: Seskupování

source: Function
cs: Funkce

source: You need to select at least one grouping column.
cs: Musíte zvolit alespoň jeden sloupec pro seskupování.

source: Open file
cs: Otevřít soubor

source: Open files
cs: Otevřít soubory

source: Save file
cs: Uložit soubor

source: Save files
cs: Uložit soubory

source: Directory selection
cs: Výběr adresáře

source: dual form
cs: duální formulář

source: dual view
cs: duální náhled

source: This form was newly added to the application. You can move this form to a position of your choice simply by dragging the tab or hide it from the context menu (right click) if you don't need it.
cs: Tento formulář byl nově přidán do aplikace. Můžete jej přesunout na požadovanou pozici jednoduše přetažením ouška záložky myší, nebo jej skrýt z kontextového menu na pravé tlačítko, pokud jej nepotřebujete.

source: Available forms
cs: Zobrazené formuláře

source: Close this form
cs: Zavřít tento formulář

source: Filter the main form for non-empty side form
cs: Filtrovat hlavní formulář na neprázdný vedlejší formulář

source: Show only those rows of the main form, which have at least one row in this side form in its current profile.
cs: Zobrazit pouze ty řádky hlavního formuláře, pro které tento vedlejší formulář obsahuje v aktuálním profilu nenulový počet řádků.

source: Filter the main form for empty side form
cs: Filtrovat hlavní formulář na prázdný vedlejší formulář

source: Show only those rows of the main form, which have no rows in this side form in its current profile.
cs: Zobrazit pouze ty řádky hlavního formuláře, pro které tento vedlejší formulář neobsahuje v aktuálním profilu žádné řádky.

source: Unable to close the last form.
cs: Nepodařilo se uzavřít poslední formulář.

source: Can't filter when the current profile is not saved!
cs: Filtrování nemůže být provedeno, pokud aktuální profil není uložen!

source: Save
cs: Uložit

source: The requested side form is not available.
cs: Požadovaný vedlejší formulář není dostupný.

source: tabbed dual form
cs: vícenásobný duální formulář

source: Form startup already takes long. Should it be interrupted?
cs: Načtení formuláře trvá příliš dlouho. Přerušit?

source: You don't have permission to display the form.
cs: Nemáte právo zobrazit tento formulář.

source: You don't have permission to insert a new record.
cs: Nemáte právo vložit nový záznam.

source: You don't have permission to edit the record.
cs: Nemáte právo upravovat tento záznam.

source: You don't have permission to delete the record.
cs: Nemáte právo smazat tento záznam.

source: You don't have permission to export the table data.
cs: Nemáte právo exportu k této tabulce.

source: New report
cs: Nová sestava

source: Edit report
cs: Editace sestav

source: Delete report
cs: Mazání sestav

source: Default profile
cs: Výchozí profil

source: Initial profile
cs: Počáteční profil

source: Row number
cs: Číslo řádku

source: Row number between 1 and %d
cs: Číslo řádku mezi 1 a %d

source: Keep
cs: Ponechat

source: Remove
cs: Odstranit

source: User profile "%s" is invalid. The form specification has probably changed and the saved profile is incompatible now. You can either remove the profile, or keep it and ask the administrator to update it.
cs: Uživatelský profil "%s" je neplatný. Pravděpodobně došlo ke změně definice náhledu a uložený profil nyní nelze použít. Profil můžete buďto odstranit, nebo ponechat a požádat správce aplikace o jeho obnovení.

source: Invalid profile
cs: Neplatný profil

source: Profile of this name already exists.
cs: Takto pojmenovaný profil již existuje.

source: Profile saved as '%s'.
cs: Profil uložen pod názvem '%s'.

source: Export profiles
cs: Exportovat profily

source: Select the profiles to be exported:
cs: Zvolte profily, které mají být exportovány:

source: Import profiles
cs: Import profilů

source: Select the profiles to be imported:
cs: Zvolte profily, které mají být importovány:

source: (duplicate title)
cs: (duplicitní název)

source: This column can not be used for filtering.
cs: Podle tohoto sloupce nelze filtrovat.

source: This column can not be used for sorting.
cs: Podle tohoto sloupce nelze třídit.

source: Unnamed profile
cs: Nepojmenovaný profil

source: Operation canceled.
cs: Operace zrušena.

source: The record is locked.
cs: Záznam je zamčen.

source: Another user is currently editing this record. Please, try repeating the action later.
cs: Tento záznam právě upravuje jiný uživatel. Zkuste, prosím, akci opakovat později.

source: Please close the form using the Cancel button.
cs: Uzavřte, prosím, formulář tlačítkem Zrušit.

source: This form contains the mandatory field %s, but you don't have access to its codebook values.
cs: Tento náhled obsahuje povinné políčko %s, k jehož číselníkovým hodnotám nemáte přístup.

source: Please contact the access rights administrator.
cs: Obraťte se na správce přístupových práv.

source: This form contains the field %s, but you don't have access to its codebook values.
cs: Tento náhled obsahuje políčko %s, k jehož číselníkovým hodnotám nemáte přístup.

source: This form contains the mandatory field %s, but this field is encrypted and the encryption area '%s' has not been unlocked.
cs: Tento formulář obsahuje povinné políčko %s, ale toto políčko je šifrované a šifrovací oblast %s nebyla odemčena.

source: The inserted record didn't appear in the current view.
cs: Vložený záznam se neobjevil v aktuálním náhledu.

source: Pipe
cs: Roura

source: Comma
cs: Čárka

source: Semicolon
cs: Středník

source: TAB
cs: Tabelátor

source: Other
cs: Jiný

source: Insufficient permissions to insert records to this table.
cs: Nemáte práva pro vkládání záznamů do této tabulky.

source: You will be able to choose the file containing the imported data in the next step. You will be prompted to check and confirm each record separately afterwards.
cs: V následujícím kroku vyberete soubor obsahující importovaná data. Poté budete moci zkontrolovat a potvrdit jednotlivě každý záznam .

source: Input file format
cs: Formát vstupního souboru

source: Each row contains a sequence of values separated by the separator selected below.
cs: Každý řádek obsahuje seznam hodnot oddělených znakem zvoleným níže.

source: The first row must contain a sequence of column identifiers. The following rows contain sequences of data values for the columns named in the first row.
cs: První řádek musí obsahovat seznam identifikátorů sloupců. Následující řádky potom obsahují hodnoty sloupců uvedených na prvním řádku v uvedeném pořadí.

source: Possible column identifiers for this form are:
cs: Identifikátory jednotlivých sloupců jsou následující:

source: Batch import
cs: Dávkové zpracování

source: Separator
cs: Oddělovač

source: The character used to separate column values in each input row. Select one of the predefined options, or choose Other to enter a custom character.
cs: Znak používaný k oddělení hodnot ve sloupcích v každém vstupním řádku. Vyberte jednu z předdefinovaných možností, nebo zvolte Jiné a zadejte vlastní znak.

source: Encoding
cs: Kódování

source: Unsupported encoding.
cs: Nepodporované kódování.

source: Separator character selection
cs: Výběr znaku oddělovače

source: No file given. Import aborted.
cs: Nebyl zadán soubor. Import ukončen.

source: The file is not encoded in {encoding}. Please choose the correct encoding for this file, or save it using {encoding} and try again.
cs: Soubor není v kódování {encoding}. Zvolte správné kódování pro tento soubor, nebo jej uložte v {encoding} a zkuste to znovu.

source: The file is empty.
cs: Soubor je prázdný.

source: Invalid column id in CSV file, line 1: '{}'
cs: Neznámý identifikátor sloupce v CSV souboru, řádek 1: '{}'

source: Invalid data in CSV file line {}:
cs: Neplatná hodnota v CSV souboru řádek {}:

source: Insert anyway
cs: Přesto vložit

source: Insert this row despite validation errors.
cs: Vložit tento řádek, přestože některé hodnoty jsou neplatné.

source: Skip row
cs: Přeskočit řádek

source: Do not import this row and continue.
cs: Nevkládat tento řádek a pokračovat.

source: Stop the import process.
cs: Zastavit proces importu

source: Original version
cs: Původní verze

source: Competing version
cs: Konkurenční verze

source: Someone else has changed the same text while you made your modifications. You can see the overview of the changes below. The safest resolution is to discard your changes and start over with the new version of the text. If your modifications were too extensive, you can try incorporating the below listed changes into your version.
cs: Někdo jiný změnil stejný text během doby, kdy jste prováděl(a) tyto úpravy. Níže vidíte výpis změn, které byly provedeny. Nejbezpečnější je vaše změny zahodit a začít znovu upravovat novou podobu textu. Pokud byly vaše úpravy příliš rozsáhlé, můžete se pokusit obě verze sloučit tím, že do Vašeho současného textu aplikujete níže uvedené změny.

source: Conflicting modifications
cs: Konflikt editace

source: Edit the competing version
cs: Upravit konkurenční verzi

source: Resume editing, switching to the competing version.
cs: Vrátit se do editoru a použít konkurenční verzi.

source: Edit my version
cs: Upravit mou verzi

source: Resume editing my version.
cs: Vrátit se do editoru a použít mou verzi.

source: Save my version
cs: Uložit mou verzi

source: Overwrite the competing version with my version.
cs: Přepsat konkurenční verzi mou verzí.

source: The searched record was not found. It may be caused by the active filter. Do you want to activate the unfiltered profile %s and try searching again?
cs: Požadovaný záznam nebyl nalezen. Může to být tím, že formulář má zapnutý filtr. Chcete aktivovat nefiltrovaný profil %s a zkusit záznam vyhledat znovu?

source: The time limit for editing the form has elapsed.
cs: Vypršel časový limit pro editaci formuláře.

source: Would you like to continue editing?
cs: Chcete v editaci ještě pokračovat?

source: Continue editing?
cs: Pokračovat v editaci?

source: Integrity check failed
cs: Kontrola integrity selhala

source: The record {} has been saved successfully.
cs: Záznam {} byl úspěšně uložen.

source: All records have been processed.
cs: Všechny záznamy byly zpracovány.

source: Record update failed
cs: Uložení záznamu se nezdařilo

source: Transaction aborted, unable to continue
cs: Transakce přerušena, nelze pokračovat

source: Unsaved changes in form data!
cs: Data byla změněna a nebyla uložena!

source: Do you really want to quit without saving?
cs: Opravdu chcete odejít bez uložení?

source: You are leaving the form without saving the current record while at the last record of batch insertion.
cs: Opouštíte formulář bez uložení aktuálního záznamu, který je posledním záznamem dávkového režimu vkládání.

source: Abort without saving
cs: Ukončit bez uložení
