Repository: cerha/pytis
Catalog: translations/pytis-wx.*.po
Languages: cs

source: Abort insertion without saving the current record.
cs: Ukončit vkládání bez uložení aktuálního záznamu.

source: Back
cs: Zpět

source: Return to the current record.
cs: Vrátit se k aktuálnímu záznamu.

source: Next record
cs: Další záznam

source: Advance to the next record in the batch
cs: Postoupit na další záznam dávky

source: Abort batch
cs: Ukončit dávku

source: Skip the rest of the batch
cs: Přeskočit zbytek dávky

source: Return to the current record
cs: Vrátit se k aktuálnímu záznamu

source: You are leaving the form without saving the current record during batch insertion.
cs: Opouštíte formulář bez uložení aktuálního záznamu v průběhu dávkového režimu vkládání.

source: There is %d more record after the current one until the end of the batch.
cs: Kromě aktuálního záznamu zbývá %d další záznam do konce dávky.

source: Do you want to:
cs: Chcete:

source: edit form
cs: editační formulář

source: Notification area
cs: Oznamovací oblast

source: Batch insertion progress indicator
cs: Ukazatel pozice dávkového vkládání

source: Save the current record and advance to the next one.
cs: Uložit současný záznam a postoupit na následující záznam.

source: Save the record and close the form.
cs: Uložit záznam a uzavřít formulář.

source: Close the form without saving
cs: Uzavřít formulář bez uložení dat

source: Next
cs: Další

source: Save the current record without closing the form to allow next record insertion.
cs: Uložit záznam bez uzavření formuláře.

source: Refresh view
cs: Aktualizovat náhled

source: Refresh the underlying database view.
cs: Aktualizovat data databázového náhledu

source: Apply
cs: Aplikovat

source: Reload form data with current query field values.
cs: Přenačíst data formuláře dle aktuálních hodnot políček dotazu.

source: Query fields contain unapplied changes. Apply now?
cs: Políčka dotazu obsahují neuplatněné změny. Aplikovat nyní?

source: unknown
cs: neznámo

source: %s ago
cs: před %s

source: Last refreshed:
cs: Poslední aktualizace:

source: insert form
cs: vkládací formulář

source: view form
cs: náhledový formulář

source: Last record
cs: Poslední záznam

source: First record
cs: První záznam

source: Document
cs: Dokument

source: document view
cs: náhled dokumentu

source: file preview
cs: náhled souboru

source: Restore the original value
cs: Vrátit původní hodnotu

source: Discard all changes.
cs: Vrátit veškeré provedené změny.

source: The field is ineditable due to insufficient permissions.
cs: Políčko je needitovatelné z důvodu nedostatečných přístupových práv.

source: The field value is not visible due to insufficient permissions.
cs: Hodnota políčka není viditelná z důvodu nedostatečných přístupových práv.

source: The field is not editable.
cs: Políčko je needitovatelné.

source: Validation error:
cs: Chyba validace:

source: this field is mandatory
cs: toto políčko je povinné

source: The current field value is valid.
cs: Aktuální hodnota políčka je platná.

source: Invalid value
cs: Neplatná hodnota

source: Invalid character!
cs: Nepovolený znak!

source: Maximal length exceeded.
cs: Překročena maximální délka.

source: Cut
cs: Vyjmout

source: Cut the selected text to clipboard.
cs: Vyjmout označený text a uložit jej do schránky.

source: Copy
cs: Kopírovat

source: Copy the selected text to clipboard.
cs: Zkopírovat označený text do schránky.

source: Paste
cs: Vložit

source: Paste text from clipboard.
cs: Vložit text ze schránky do políčka.

source: Select All
cs: Vybrat vše

source: Select entire field value.
cs: Označit celou hodnotu.

source: Show/hide password
cs: Zobrazit/skrýt heslo

source: Select from Calendar
cs: Vybrat z kalendáře

source: Show the calendar for date selection.
cs: Zobrazit kalendář pro výběr datumu.

source: Select Color
cs: Vybrat barvu

source: Show the color selection dialog.
cs: Zobrazit dialog pro výběr barev.

source: Select from Codebook
cs: Vybrat z číselníku

source: Show the selection of available codebook values.
cs: Zobrazit výběr možných číselníkových hodnot.

source: Insert a new codebook value.
cs: Vložit novou hodnotu do číselníku.

source: Search in codebook
cs: Vyhledat v číselníku

source: Show the codebook and start incremental search.
cs: Zobrazit číselník se zapnutým inkrementálním vyhledáváním.

source: unlimited
cs: neomezeno

source: Select this item as active.
cs: Zvolit tuto položku jako aktivní.

source: Show selected item
cs: Najít vybranou položku

source: Locate the currently selected item.
cs: Nalistovat v seznamu vybranou položku.

source: Show codebook
cs: Zobrazit číselník

source: Open the codebook form.
cs: Otevřít číselníkový formulář.

source: Edit selected item
cs: Upravit vybranou položku

source: Open the selected item in edit form.
cs: Otevřít vybranou položku v editačním formuláři.

source: Remove selected item
cs: Smazat vybranou položku

source: Remove the selected item from the codebook.
cs: Vymazat vybranou položku z číselníku.

source: Insert new item
cs: Vložit novou položku

source: Open form for new codebook record insertion.
cs: Otevřít formulář pro vložení nového záznamu do číselníku.

source: Show the entire table
cs: Zobrazit celou tabulku

source: Open the codebook in a standalone form.
cs: Otevřít náhled číselníku v samostatném formuláři.

source: Really remove the item %s from the codebook permanently?
cs: Opravdu chcete položku %s zcela vymazat z číselníku?

source: Select File
cs: Vybrat soubor

source: Show a dialog to browse files in the file system.
cs: Zobrazit dialog pro procházení systému souborů.

source: Open
cs: Otevřít

source: Open the file in a preferred application.
cs: Otevřít soubor v preferované aplikaci.

source: Load from file
cs: Nastavit ze souboru

source: Set the field value from a file.
cs: Nahradit hodnotu políčka daty ze souboru.

source: Save to file
cs: Uložit do souboru

source: Save the current field value as file.
cs: Uložit aktuální hodnotu políčka jako soubor.

source: Clear value
cs: Vynulovat hodnotu

source: Set the field to an empty value.
cs: Nastavit prázdnou hodnotu.

source: Error reading file:
cs: Chyba při čtení souboru:

source: File loaded.
cs: Soubor načten.

source: Loading file canceled.
cs: Načtení souboru zrušeno.

source: Error writing file to disk:
cs: Chyba při zápisu souboru na disk:

source: File saved.
cs: Soubor byl uložen.

source: Saving file canceled.
cs: Ukládání souboru zrušeno.

source: Error accessing attachment storage
cs: Chyba přístupu k úložišti příloh

source: Inline
cs: Do řádku

source: Left
cs: Vlevo

source: Right
cs: Vpravo

source: Small preview (%d px), click to enlarge
cs: Malý náhled (%d px), kliknutím se zvětší

source: Larger preview (%d px), click to enlarge
cs: Větší náhled (%d px), kliknutím se zvětší

source: Full size (appropriate for screenshot etc.)
cs: V plné velikosti (vhodné pro snímek obrazovky apod.)

source: Heading level
cs: Úroveň nadpisu

source: Insert markup for heading of given level.
cs: Vložit značky pro nadpis dané úrovně.

source: Bold text
cs: Tučný text

source: Insert markup for bold text.
cs: Vložit značku pro tučný text.

source: Slanted
cs: Skloněné písmo

source: Insert markup for text emphasized by slanted font.
cs: Vložit značku pro text zvýrazněný skloněným písmem.

source: Underlined text
cs: Podtržený text

source: Insert markup for underlined text.
cs: Vložit značku pro podtržený text.

source: Hypertext link
cs: Hypertextový odkaz

source: Insert markup hypertext link.
cs: Vložit značku pro hypertextový odkaz.

source: Image
cs: Obrázek

source: Insert image.
cs: Vložit obrázek.

source: Attachment
cs: Příloha

source: Attach file.
cs: Vložit soubor.

source: Itemized list
cs: Odrážkový seznam

source: Create a bullet list item.
cs: Vytvořit položku odrážkového seznamu.

source: Numbered list
cs: Číslovaný seznam

source: Create a numbered list item.
cs: Vytvořit položku číslovaného seznamu.

source: Preformatted text
cs: Předformátovaný text

source: Insert markup for preformatted text.
cs: Vložit značky pro předformátovaný text.

source: Line break
cs: Vynucený řádkový zlom

source: Insert markup for explicit line break.
cs: Vložit vynucený řádkový zlom.

source: Show HTML preview
cs: Zobrazit HTML náhled

source: Show preview of the text formatted as HTML.
cs: Zobrazit náhled zformátovaného textu jako HTML.

source: Show PDF preview
cs: Zobrazit PDF náhled

source: Show preview of the text formatted as PDF.
cs: Zobrazit náhled zformátovaného textu jako PDF.

source: Open in a standalone editor
cs: Upravit v samostatném editoru

source: Invalid image format!
cs: Neplatný grafický formát!

source: Preview
cs: Náhled

source: Invalid file name
cs: Neplatný název souboru

source: Invalid characters in file name.
cs: Nepovolené znaky v názvu souboru.

source: File not selected!
cs: Soubor nebyl vybrán!

source: Available files
cs: Dostupné soubory

source: Choose one of available files or insert a new file from your computer.
cs: Vyberte jeden z dostupných souborů, nebo vložte nový z vašeho počítače.

source: Display in page as
cs: Zobrazit ve stránce jako

source: Choose the size and behavior of the image within the page.
cs: Vyberte jeden z uvedených způsobů zobrazení obrázku ve stránce.

source: Original size
cs: Velikost originálu

source: Preview size
cs: Velikost náhledu

source: Resize ratio
cs: Poměr zmenšení

source: Alignment
cs: Zarovnání

source: Enter the text displayed above the image when the mouse moves over.
cs: Zadejte text zobrazený při najetí myší na obrázek.

source: Insert new
cs: Vložit nový

source: Insert Image
cs: Vložit obrázek

source: Enter the link label displayed within document text. Leave empty if you want to display the file name directly.
cs: Zadejte název zobrazený v textu dokumentu. Ponechte prázdné, pokud chcete zobrazit přímo název souboru.

source: Enter the text displayed above the link when the mouse moves over.
cs: Zadejte text zobrazený při najetí myší na odkaz.

source: Insert attachment
cs: Vložit přílohu

source: Link properties
cs: Vlastnosti odkazu

source: Target
cs: Cíl

source: Enter the absolute URL, such as http://www.mycompany.com or a local link, such as an identifier of another page in the CMS.
cs: Zadejte absolutní URL ve tvaru např. http://www.mojefirma.com nebo lokální adresu jako např. identifikátor jiné stránky v CMS.

source: Enter the link label displayed within the document text. Leave empty if you want to display the target URL directly.
cs: Zadejte název zobrazený v textu dokumentu. Ponechte prázdné, pokud chcete zobrazit přímo URL zadané v předchozím políčku.

source: Sum
cs: Součet

source: Sum:
cs: Součet:

source: Average
cs: Průměr

source: Avg:
cs: Průměr:

source: row form
cs: řádkový formulář

source: Minimize/maximize query panel.
cs: Minimalizovat/maximalizovat panel dotazu.

source: Move the query panel to the top/bottom edge of the form.
cs: Přesunout panel dotazu na horní/dolní okraj formuláře.

source: Cancel selection
cs: Zrušit výběr

source: Cancel the selection of rows for bulk operations.
cs: Zrušit výběr řádků pro hromadné akce.

source: Add row to selection
cs: Přidat řádek do výběru

source: Add this row to the current selection of rows for bulk operations.
cs: Přidat tento řádek do aktuálního výběru řádků pro hromadné akce.

source: Remove row from selection
cs: Odebrat řádek z výběru

source: Remove this row from the current selection of rows for bulk operations.
cs: Odebrat tento řádek z aktuálního výběru řádků pro hromadné akce.

source: (hidden)
cs: (skrytý)

source: Choose the column to search in (incremental search is only possible in text columns).
cs: Zvolte sloupec, ve kterém chcete vyhledávat (inkrementální vyhledávání je možné pouze nad sloupci s řetězcovými hodnotami).

source: Enter the text search for.
cs: Zadejte hledaný text.

source: Find previous
cs: Najít předchozí

source: Find next
cs: Najít následující

source: search also inside values
cs: hledat i uvnitř řetězce

source: Check if you want to search anywhere inside the value. Otherwise the substring is only searched at the start of the string.
cs: Zaškrtněnte, pokud chcete vyhledávat kdekoliv uvnitř hodnoty. Jinak bude podřetězec vyhledáván pouze od počátku řetězce.

source: case sensitive
cs: rozlišovat velikost písmen

source: Check if you want to distinguish lower and upper case letters.
cs: Zaškrtněnte, pokud chcete aby vyhledávání rozlišovalo malá a velká písmena.

source: Hide the search panel
cs: Skrýt vyhledávací panel

source: No next matching record
cs: Další záznam nenalezen

source: The limit for operation on selection is {limit} rows, but the current selection contains {length} rows.
cs: Limit pro operaci nad výběrem je {limit} řádků, ale současný výběr obsahuje {length} řádků.

source: Display row headings
cs: Zobrazit záhlaví řádků

source: Hide this column
cs: Skrýt tento sloupec

source: Add column
cs: Přidat sloupec

source: Displayed columns
cs: Zobrazené sloupce

source: Show all
cs: Zobrazit vše

source: Hide all
cs: Skrýt vše

source: Open predefined aggregated view
cs: Otevřít předdefinovaný agregovaný náhled

source: Open user defined aggregated view
cs: Zobrazit uživatelský agregovaný náhled

source: Define new aggregated view
cs: Nový agregovaný náhled

source: Remove aggregated view
cs: Smazat agregovaný náhled

source: Primary Sorting
cs: Primární řazení

source: Sort Ascending
cs: Řadit vzestupně

source: Sort Descending
cs: Řadit sestupně

source: Secondary Sorting
cs: Dodatečné řazení

source: Omit this column from sorting
cs: Neřadit podle tohoto sloupce

source: Cancel sorting completely
cs: Zrušit řazení úplně

source: Group up to this column
cs: Seskupovat až po tento sloupec

source: Cancel visual grouping
cs: Zrušit vizuální seskupování

source: Autofilter
cs: Autofiltr

source: Cancel filtering
cs: Zrušit filtrování

source: Copy the Result
cs: Zkopírovat výsledek

source: Result of aggregation function %(aggregation)s for column %(column)s
cs: Výsledek funkce %(aggregation)s pro sloupec %(column)s

source: Hide row headings
cs: Skrýt záhlaví řádků

source: Select the columns to be displayed:
cs: Zvolte zobrazené sloupce:

source: Count
cs: Počet

source: Too many items for autofilter.
cs: Příliš mnoho položek pro autofiltr.

source: Can not filter as long as the current profile is unsaved!
cs: Filtrování nemůže být provedeno, pokud aktuální profil není uložen!

source: Unable to search incrementally in this column.
cs: V tomto sloupci nelze vyhledávat inkrementálně.

source: You don't have permissions to export this table.
cs: Nemáte právo exportu k této tabulce.

source: The table has no rows!
cs: Tabulka neobsahuje žádné řádky!

source: The table has too many rows! Use a filter.
cs: Formulář má příliš mnoho řádků. Je třeba ho vyfiltrovat.

source: Export aborted.
cs: Export nebude proveden.

source: Export options
cs: Nastavení exportu

source: Scope
cs: Rozsah

source: All rows
cs: Všechny řádky

source: Selected rows only
cs: Pouze vybrané řádky

source: Select the extent of rows to be exported.
cs: Zvolte které řádky mají být do exportu zahrnuty.

source: File format
cs: Formát souboru

source: Choose the export file format
cs: Zvolte formát exportního souboru

source: Action
cs: Akce

source: Save to disk
cs: Uložit na disk

source: Open in spreadsheet
cs: Otevřít v tabulkovém editoru

source: Select what to do with the exported file
cs: Zvolte co se má s exportovaným souborem provést

source: XLSX support not installed. Ask your administrator.
cs: Podpora XLSX exportu není nainstalována. Požádejte správce aplikace o asistenci.

source: Unable to open the file for writing!
cs: Nepodařilo se otevřít soubor pro zápis!

source: Encoding %s not supported.
cs: Kódování %s není podporováno.

source: Unable to encode data to %s.
cs: Nebylo možné zakódovat data do %s.

source: Using UTF-8 instead.
cs: Bude použito UTF-8.

source: You attempted to use a filter with the IN operator on a foldable form. This operation may potentially take several minutes. You can greatly speed up the operation by turning the folding off (sorting by another column). Really continue?
cs: Pokoušíte se uplatnit filtr s operátorem IN na rozbalovacím formuláři. Tato operace může trvat i několik minut. Vypnutím rozbalování (přepnutím řazení podle jiného sloupce) můžete operaci podstatně urychlit. Opravdu chcete pokračovat?

source: Select folding level
cs: Zvolte úroveň sbalení

source: Folding level
cs: Úroveň sbalení

source: Enter the number denoting the folding level to fold/unfold
cs: Zadejte číslo udávající úroveň na kterou bude sbaleno/rozbaleno

source: codebook
cs: číselník

source: Unable to search incrementally. No sortable column found!
cs: Nelze začít inkrementální vyhledávání. Nenalezen žádný setříděný sloupec!

source: Confirm selection
cs: Potvrdit výběr

source: Filter by cell
cs: Filtrovat podle buňky

source: Filter the rows containing the same value in this column.
cs: Vyfiltrovat řádky obsahující v tomto sloupci stejnou hodnotu.

source: Copy cell value
cs: Zkopírovat obsah buňky

source: Copy the contents of the cell into the clipboard.
cs: Zkopírovat obsah buňky do schránky.

source: Open a separate edit form for this record.
cs: Otevřít editační formulář pro tento záznam.

source: Copy record
cs: Kopírovat záznam

source: Open a separate insert form with a copy of this record.
cs: Otevřít formulář pro vložení kopie tohoto záznamu.

source: Delete the record permanently from the database.
cs: Trvale odstranit záznam z databáze.

source: Preview form
cs: Náhledový formulář

source: Open the preview form for browsing all records.
cs: Otevřít náhledový formulář s možností procházení záznamů.

source: Dual preview
cs: Duální náhled

source: Open a dual form with a table up and preview at the bottom.
cs: Otevřít formulář s tabulkou nahoře a náhledem v dolní části.

source: Text editor for field %s
cs: Textový editor políčka %s

source: Open a structured text editor.
cs: Otevřít editor strukturovaného textu.

source: PDF preview of %s
cs: PDF náhled políčka %s

source: Open PDF preview of field contents.
cs: Otevřít PDF náhled obsahu políčka.

source: Link - %s
cs: Odskok - %s

source: Edit %s
cs: Editovat %s

source: Show %s
cs: Náhled %s

source: Insert for %s
cs: Nový záznam pro %s

source: Preview %s
cs: Náhled %s

source: Insert a new record for value '%(value)s' of column %(column)s.
cs: Vložit záznam pro hodnotu '%(value)s' sloupce %(column)s.

source: Search value of column %s
cs: Vyhledat hodnotu sloupce %s

source: Search the record for value '%(value)s' of column %(column)s.
cs: Vyhledat záznam pro hodnotu '%(value)s' sloupce %(column)s.

source: Edit the record of column %s
cs: Upravit záznam sloupce %s

source: Edit the record for value '%(value)s' of column %(column)s.
cs: Upravit záznam pro hodnotu '%(value)s' sloupce %(column)s.

source: Show the record of column %s
cs: Zobrazit záznam sloupce '%s'

source: Show the record for value '%(value)s' of column %(column)s.
cs: Zobrazit záznam pro hodnotu '%(value)s' sloupce '%(column)s'.

source: Filter "%(view_title)s" for rows not contained in column "%(column)s" of the current form.
cs: Filtrovat náhled „%(view_title)s“ na řádky neobsažené ve sloupci „%(column)s“ současného náhledu.

source: Filter "%(view_title)s" for rows contained in column "%(column)s" of the current form.
cs: Filtrovat náhled „%(view_title)s“ na řádky obsažené ve sloupci „%(column)s“ současného náhledu.

source: Links
cs: Odskoky

source: Filter existing values (operator IN)
cs: Filtrovat přítomné hodnoty (operátor IN)

source: Filter missing values (operator NOT IN)
cs: Filtrovat nepřítomné hodnoty (operátor NOT IN)

source: Open with side forms
cs: Zobrazit včetně vedlejších formulářů

source: Open the current record in a main form with related data in side forms.
cs: Zobraz aktuální záznam v hlavním formuláři se souvisejícími daty ve vedlejších formulářích.

source: Aggregated View
cs: Agregovaný náhled

source: Invalid file format: Not a JSON file.
cs: Neplatný formát souboru: Není to soubor JSON.

source: Invalid JSON data structure.
cs: Neplatná JSON struktura.

source: Exported file version does not match the current application version.
cs: Verze exportovaného souboru neodpovídá aktuální verzi aplikace.

source: Profiles incompatible with the current form.
cs: Profily nejsou kompatibilní s aktuálním formulářem.

source: Empty profiles list.
cs: Prázdný seznam profilů.

source: Space
cs: Mezerník

source: Open file "%s"
cs: Otevřít soubor „%s“

source: Open the value of field "%s" as a file.
cs: Otevřít hodnotu políčka „%s“ jako soubor.

source: Prefix key: %s
cs: Prefixová klávesa: %s

source: (invalid)
cs: (neplatný)

source: System Profiles
cs: Systémové profily

source: User Profiles
cs: Uživatelské profily

source: Save current profile settings
cs: Uložit aktuální nastavení profilu

source: Update the saved profile according to the current form setup.
cs: Aktualizovat uložený profil podle současného nastavení formuláře.

source: Duplicate current profile
cs: Duplikovat aktuální profil

source: Create a new profile according to the current form setup.
cs: Vytvořit nový profil podle současného nastavení formuláře.

source: Rename current profile
cs: Přejmenovat aktuální profil

source: Change the name of the current profile and save it.
cs: Upravit a uložit název aktuálního profilu.

source: Delete current profile
cs: Smazat aktuální profil

source: Delete the selected saved profile.
cs: Smazat zvolený uložený profil.

source: Use this profile automatically on form startup
cs: Použít tento profil automaticky při startu formuláře

source: Automatically switch to this profile when this form is opened next time.
cs: Automaticky přepnout na současný profil při příštím otevření formuláře.

source: Restore to previously saved form settings
cs: Vrátit poslední uložené nastavení formuláře

source: Discard changes in form settings since the profile was last saved.
cs: Zahodit změny nastavení formuláře provedené od posledního uložení profilu.

source: Restore to default form settings
cs: Vrátit výchozí nastavení formuláře

source: Discard all user changes in form settings.
cs: Zahodit všechny uložené uživatelské změny nastavení formuláře.

source: Export user profiles to file
cs: Exportovat uživatelské profily do souboru

source: Export user defined form profiles to a file.
cs: Exportovat uživatelem definovné profily do souboru.

source: Import profiles from file
cs: Importovat profily ze souboru

source: Import form profiles from a file.
cs: Importovat profily formuláře ze souboru.

source: Enter the profile name and press ENTER when done.
cs: Zadejte název profilu a potvrďte stiskem ENTER.

source: Regular text
cs: Běžný text

source: Heading level {}
cs: Nadpis úrovně {}

source: Document loaded.
cs: Dokument byl načten.

source: Loading document failed.
cs: Načtení dokumentu se nezdařilo.

source: External URL navigation denied: %s
cs: Přechod na externí URL zamítnut: %s

source: Go back to the previous location in browser history.
cs: Zobrazit předchozí položku historie prohlížení.

source: Forward
cs: Vpřed

source: Go forward to the following location in browser history.
cs: Zobrazit následující položku historie prohlížení.

source: Reload
cs: Obnovit

source: Reload the current document.
cs: Načíst aktuální dokument znovu.

source: Stop
cs: Zastavit

source: Stop loading the document.
cs: Zastavit načítání dokumentu.

source: Location
cs: Adresa

source: Current browser URI.
cs: Aktuální adresa prohlížeče.

source: Unsupported file type: %s
cs: Nepodporovaný typ souboru: %s

source: Loading document failed: %s
cs: Načtení dokumentu se nezdařilo: %s

source: Sorting
cs: Řazení

source: Reset to default sorting
cs: Obnovit výchozí řazení

source: Ascending
cs: Vzestupně

source: Descending
cs: Sestupně

source: No sorting
cs: Neřadit
