Repository: cerha/pytis
Catalog: translations/pytis-defs.*.po
Languages: cs

source: Form profiles
cs: Profily formulářů

source: Profile ID
cs: Id profilu

source: Errors
cs: Chyby

source: Invalid
cs: Neplatný

source: Invalid profiles
cs: Neplatné profily

source: User profiles
cs: Uživatelské profily

source: System profiles
cs: Systémové profily

source: Form settings
cs: Nastavení formulářů

source: Form type
cs: Typ formuláře

source: Overview of used forms
cs: Přehled používaných formulářů

source: Form name
cs: Jméno formuláře

source: Number of users
cs: Počet uživatelů

source: Number of opens
cs: Počet otevření

source: Average startup time
cs: Průměrná doba startu

source: Last used
cs: Poslední spuštění

source: Detailed overview of used forms
cs: Podrobný přehled používaných formulářů

source: Form parameters
cs: Parametry formuláře

source: Form users
cs: Uživatelé formuláře

source: Forms
cs: Formuláře

source: User forms
cs: Formuláře uživatele
