Repository: cerha/pytis
Catalog: translations/pytis-wx.*.po
Languages: cs

source: Choose the sorting column.
cs: Zvolte sloupec, podle nějž chcete řadit.

source: Choose the sorting direction.
cs: Zvolte směr řazení.

source: Add
cs: Přidat

source: Add secondary sorting column.
cs: Přidat sloupec sekundárního řazení.

source: value
cs: hodnota

source: Error in condition no. %d: %s
cs: Chyba v podmínce č. %d: %s

source: Choose the logical operator to join with previous conditions.
cs: Zvolte způsob spojení s předchozími podmínkami.

source: Operator weight:
cs: Váha operátoru:

source: Choose the level of precedence of the logical operator.
cs: Zvolte úroveň priority logického operátoru.

source: Choose the table column (first operand).
cs: Zvolte sloupec tabulky (první operand).

source: Choose the operator.
cs: Zvolte operátor.

source: Choose the second operand.
cs: Zvolte druhý operand.

source: Enter the operand value.
cs: Zapište hodnotu operandu.

source: Gather
cs: Nasát

source: Use the value from the current form row.
cs: Načíst hodnotu aktivní buňky.

source: Clear the condition.
cs: Vymazat obsah podmínky.

source: Remove this condition.
cs: Odebrat tuto podmínku.

source: Failed to decompose the conditional expression:
cs: Nepodařilo se rozložit podmínkový výraz:

source: Add AND
cs: Přidat AND

source: Add a new condition in conjunction.
cs: Přidat novou podmínku v konjunkci (a zároveň).

source: Add OR
cs: Přidat OR

source: Add a new condition in disjunction.
cs: Přidat novou podmínku v disjunkci (a nebo)

source: Remove all
cs: Odstranit vše

source: Remove all current conditions.
cs: Zrušit všechny stávající podmínky.

source: Incompatible types %s and %s
cs: Neslučitelné typy %s a %s

source: Binary column can only be compared with value.
cs: Binární sloupec lze testovat pouze na prázdnou hodnotu.

source: Binary column can only be tested for equality/inequality.
cs: Binární sloupec lze testovat pouze na rovnost či nerovnost.

source: Range must consist of two values separated by a dash.
cs: Rozsah musí být zadán dvěma hodnotami oddělenými pomlčkou.

source: Previous
cs: Předchozí

source: Aggregation functions
cs: Agregační funkce

source: Select the column for aggregation.
cs: Zvolte sloupec pro agregaci.

source: Select the aggregation function.
cs: Zvolte agregační funkci.

source: Displays the aggregation function result.
cs: Zobrazení výsledku agregační funkce.

source: Compute
cs: Zjistit

source: Compute the aggregation function result.
cs: Spočti výsledek zvolené agregační funkce.

source: Operation not supported for the selected column type.
cs: Tato operace není pro daný typ sloupce podporována.

source: Forms are connected through the equality of values in column '%(main_form_column)s' of the main form and column '%(side_form_column)s' of the side form.
cs: Formuláře jsou propojeny přes shodu hodnot sloupce '%(main_form_column)s' hlavního formuláře a sloupce '%(side_form_column)s' vedlejšího formuláře.

source: Opens a dual form:
cs: Otevře duální formulář:

source: Main form
cs: Hlavní formulář

source: Side form
cs: Vedlejší formulář

source: Opens %(form_type)s for %(spec_name)s
cs: Otevře %(form_type)s pro %(spec_name)s

source: Opens a form for new record insertion into %s.
cs: Vyvolá formulář pro vložení nového záznamu do náhledu %s.

source: Invokes command %s.
cs: Vyvolá příkaz %s.

source: Opens a dialog for customizing the application user interface.
cs: Vyvolá dialog pro přizpůsobení uživatelského rozhraní aplikace.

source: Opens a dialog for customizing data export.
cs: Vyvolá dialog uživatelského nastavení exportu dat.

source: Invokes procedure %s from %s.
cs: Vyvolá proceduru %s z %s.

source: Invokes %s.
cs: Vyvolá %s.

source: Reloads access rights.
cs: Vyvolá přenačtení přístupových práv.

source: Invokes form %s.
cs: Vyvolá formulář %s.

source: Exits the application.
cs: Ukončí běh aplikace.

source: Pytis User Guide
cs: Příručka uživatele systému Pytis

source: Help files not found!
cs: Soubory s nápovědou nebyly nalezeny!

source: Description not available.
cs: Popis není k dispozici.

source: Access Denied
cs: Přístup odepřen

source: You don't have permissions for specification '%s'.
cs: Nemáte přístup ke specifikaci „%s“.

source: Related views:
cs: Související náhledy:

source: Contents
cs: Obsah

source: Overview
cs: Shrnutí

source: Description
cs: Popis

source: Form fields
cs: Políčka formuláře

source: Profiles
cs: Profily

source: Context menu actions
cs: Akce kontextového menu

source: Access Rights
cs: Přístupová práva

source: Side forms
cs: Vedlejší formuláře

source: %s application help
cs: Nápověda aplikace %s

source: Not Found
cs: Nenalezeno

source: The requested help page not found: %s
cs: Požadovaná stránka nápovědy nenalezena: %s

source: Application menu
cs: Menu aplikace

source: Opens the %s on specification
cs: Otevře %s nad specifikací

source: Inserts a new record into
cs: Vloží nový záznam do

source: Runs the command: %s
cs: Vyvolá příkaz: %s

source: View
cs: Zobrazit

source: Insert
cs: Vložit nový záznam

source: Update
cs: Upravit záznam

source: Delete
cs: Smazat

source: Call
cs: Vyvolat akci

source: Export
cs: Exportovat do souboru

source: Print
cs: Vytisknout

source: Column restrictions:
cs: Omezení pro jednotlivé sloupce:

source: no access
cs: žádný přístup

source: Expand/collapse complete menu hierarchy
cs: Rozbalit/sbalit celou hierarchii menu

source: Navigation
cs: Navigace

source: Invalid column reference
cs: Chybný odkaz na sloupec

source: Going to format a table with many rows (%d).
cs: Bude se formátovat tabulka s mnoha řádky (%d).

source: Do you want to continue printing anyway?
cs: Chcete přesto pokračovat v tisku?

source: Invalid use of iterator. Maybe you refer to an non-existent or inaccessible object in the table?
cs: Chybné použití iterátoru. Možná se v tabulce odkazujete na neexistující nebo nepřístupný objekt?

source: COLUMN_IDENTIFIER
cs: IDENTIFIKÁTOR_SLOUPCE

source: Primary template variables:
cs: Proměnné pro hlavní šablonu:

source: column value insertion
cs: vložení hodnoty sloupce

source: complete table insertion
cs: vložení celé tabulky

source: value insertion in repeated table row
cs: vložení hodnoty v opakovaném řádku tabulky

source: Column identifiers:
cs: Identifikátory sloupců:

source: Codebooks:
cs: Číselníky:

source: Side forms:
cs: Vedlejší formuláře:

source: Aggregation variables:
cs: Agregační proměnné:

source: count
cs: počet

source: sum
cs: součet

source: average
cs: průměr

source: Invalid item arguments
cs: Chybné argumenty prvku

source: More than 26 columns in a table
cs: Více než 26 sloupců v tabulce

source: You are using an obsolete version of Pytis2Go. Please, contact IT support to install a newer version. Your current version will stop working soon.
cs: Používáte zastaralou verzi klienta Pytis2Go. Kontaktujte, prosím, IT podporu ohledně instalace novější verze. Vaše aktuální verze brzy přestane fungovat.

source: Unable to open file %(filename)s: %(error)s
cs: Soubor %(filename)s se nepodařilo otevřít: %(error)s

source: Unable to open URL %s
cs: URL %s se nepodařilo otevřít.

source: Unable to select a file for download: %s
cs: Nepodařilo se vybrat soubor ke stažení: %s

source: Unable to select a file to save: %s
cs: Nepodařilo se vybrat soubor k uložení: %s

source: Failed selecting directory: %s
cs: Nepodařilo se vybrat adresář: %s

source: Files selection
cs: Výběr souborů

source: File selection
cs: Výběr souburu

source: Failed selecting file: %s
cs: Nepodařilo se vybrat soubor: %s

source: For internal use only.
cs: Pouze pro interní použití.

source: Exported data encoding.
cs: Kódování exportovaných dat.

source: Must be one of Python supported encodings.
cs: Hodnota musí být jedním z podporovaných kódování v Pythonu.

source: Value of the 'author' property in XLSX meta information of export files
cs: Hodnota parametru 'autor' v XLSX meta informacích exportovaného souboru

source: Maximum time in seconds to leave an open transaction untouched.
cs: Maximální doba v sekundách, po kterou je otevřená transakce ponechána bez povšimnutí.

source: Maximum time in seconds to leave an idle transaction untouched.
cs: Maximální doba v sekundách, po kterou je nečinná transakce ponechána bez povšimnutí.

source: Show tooltips.
cs: Zobrazovat bublinovou nápovědu.

source: Stretch table columns to fit full window width.
cs: Roztahovat sloupce tabulek, aby využily celou šířku okna.

source: Show the initial splash screen.
cs: Zobrazovat úvodní uvítací dialog.

source: Enable automatic keyboard shortcut accelerators in menu items.
cs: Automaticky doplnit položky menu prefixy akcelerátorových kláves.

source: Change requires the application to be restarted.
cs: Změna vyžaduje restart aplikace.

source: Start forms saved on last exit without asking.
cs: Znovu otevřít formuláře uložené při posledním ukončení aplikace bez ptaní.

source: If true, the forms saved on last exit will be automatically loaded on application startup without asking. If False (the default), a dialog asking for confirmation of saved forms to start will be displayed.
cs: Pravdivá hodnota zajistí automatické natažení všech formulářů uložených při posledním opuštění aplikace bez dalšího dotazování. V opačném případě (výchozí nastavení) bude zobrazen dialog umožňující potvrzení znovuotevření jednotlivých uložených formulářů.

source: Current cell highlight color in table forms.
cs: Barva zvýraznění aktivní buňky tabulkového formuláře.

source: Current row highlight color in table forms.
cs: Barva zvýraznění aktivního řádku tabulkového formuláře.

source: Current row highlight color in table forms during inline editing.
cs: Barva zvýraznění aktivního řádku tabulkového formuláře během inline editace.

source: Current row highlight color in unfocussed table forms.
cs: Barva zvýraznění aktivního řádku neaktivního tabulkového formuláře.

source: Current table row highlight border width in pixels.
cs: Šířka rámečku zvýraznění aktivního řádku tabulkového formuláře v px.

source: Grid line color in table forms.
cs: Barva mřížky tabulkového formuláře.

source: Grouping background downgrade.
cs: Ztmavení barvy skupiny při seskupování řádků.

source: Grouping may be used to visually distinguish table rows that belong to the same group. Table background color is changing between the groups of rows, so that lighter colored rows are followed by darker colored rows and vice versa. The color specification in this option determines the level and the tone of the darker rows. When combined with white rows, the darker rows will have exactly the same color as specified. But some rows may be already colored otherwise and in this case the two colors are combined.
cs: Seskupování řádků může být použito k vizuálnímu rozlišení řádků které mají něco společného. Barva pozadí se mezi skupinami mění tak, že světlejší řádky střídají tmavší. Specifikace barvy v této volbě určuje ztmavení a tón relativně oproti výchozí barvě pozadí řádků. Pokud je výchozí barva bílá, bude barva skupiny odpovídat nastavené hodnotě. Pokud řádky mají jinou výchozí barvu pozadí, barvy jsou zkombinovány. O kolik je zvolená barva tmavší než bílá, o tolik bude výsledná barva skupiny tmavší, než výchozí barva. Barva je reprezentována řetězcem '#RRGGBB'.

source: Colors
cs: Barvy

source: Legends
cs: Legenda

source: Added
cs: Přidáno

source: Changed
cs: Změněno

source: Deleted
cs: Smazáno
