Repository: cerha/pytis
Catalog: translations/pytis-demo.*.po
Languages: cs

source: &System
cs: &Systém

source: User interface settings
cs: Nastavení uživatelského rozhraní

source: Export settings
cs: Nastavení exportu

source: &Run form
cs: Spustit fo&rmulář

source: &Check specification files
cs: Zkontrolovat specifikační soubory

source: Management of menus and user roles
cs: Správa rolí a přístupových práv

source: Roles
cs: Role

source: Menu Rights
cs: Práva menu

source: Form statistics
cs: Statistiky formulářů

source: Short statistics
cs: Stručné statistiky

source: Full statistics
cs: Kompletní statistiky

source: Users
cs: Uživatelé

source: User printing templates
cs: Uživatelské tiskové sestavy

source: Global printing templates
cs: Globální tiskové sestavy

source: Crypto users
cs: Uživatelé šifrování

source: Recently opened forms
cs: Nedávno otevřené formuláře

source: E&xit
cs: Ukončit

source: &Input fields
cs: Vstupní políčka

source: &Dialogs
cs: Dialo&gová okna

source: Runtime &filters
cs: Runtime filtry

source: &Query Fields
cs: &Políčka dotazu

source: Continents
cs: Světadíly

source: Countries
cs: Země

source: Products
cs: Zboží

source: Insurance (table function)
cs: Pojištění (tabulková funkce)

source: Working with files
cs: Práce se soubory

source: Storing &binary data
cs: Obecná &binární data

source: Storing &images
cs: Ukládání obrázků

source: Opening &file names and URLs
cs: Otevírání názvů souborů a URL

source: Password fields
cs: Políčka pro zadání hesla

source: Tree Order
cs: Stromové řazení

source: Foldable Tree
cs: Sbalovací strom

source: Long Table
cs: Dlouhá tabulka

source: Slow Long Table
cs: Pomalá dlouhá tabulka

source: Fast Long Table
cs: Rychlá dlouhá tabulka

source: Range Types
cs: Rozsahové typy

source: Web View
cs: Webový náhled

source: Insufficient access rights
cs: Nedostatečná přístupová práva

source: Inexistent specification
cs: Neexistující specifikace

source: Languages
cs: Jazyky

source: Modules
cs: Moduly

source: Generic actions
cs: Obecné akce

source: User Roles
cs: Uživatelské role

source: Session Log
cs: Log uživatelských sezení

source: Access Log
cs: Log přístupů

source: Color themes
cs: Barevná témata

source: Counter value: %d
cs: Hodnota čítače: %d

source: Counter
cs: Čítač

source: The returned value:
cs: Vrácená hodnota:

source: Repeat
cs: Opakovat

source: Run the same dialog again.
cs: Spustit stejný dialog znovu.

source: Done
cs: Hotovo

source: Back to dialog test control panel.
cs: Zpět na řídicí panel testu dialogů.

source: Dialog test
cs: Test dialogů

source: Simple announcements
cs: Jednoduchá oznámení

source: Message
cs: Oznámení

source: Informational message.
cs: Informační zpráva.

source: Warning
cs: Varování

source: Something is dangerous.
cs: Něco je nebezpečné.

source: Error
cs: Chyba

source: Something failed.
cs: Něco se porouchalo.

source: Announcements with additional content
cs: Oznámení s dodatečným obsahem

source: Message with plain text
cs: Zpráva s prostým textem

source: This is the HTML source code:
cs: Toto je HTML zdrojový kód:

source: HTML content without message
cs: HTML obsah bez zprávy

source: LCG content
cs: LCG obsah

source: Progress dialogs
cs: Dialogy s průběhem operace

source: Operation with time measures
cs: Operace s měřením času

source: Expanding progress dialog
cs: Expandující průběhový dialog

source: Indeterminate mode
cs: Neurčitý režim

source: Without progress indication
cs: Bez zobrazení průběhu

source: Question dialogs
cs: Dotazovací dialogy

source: Yes/No Question (default No)
cs: Otázka Ano/Ne (výchozí Ne)

source: Question with the default answer set to '%s'.
cs: Otázka s výchozí odpovědí „%s”.

source: No
cs: Ne

source: Yes/No Question (default Yes)
cs: Otázka Ano/Ne (výchozí Ano)

source: Yes
cs: Ano

source: Question with answers
cs: Otázka s výběrem odpovědí

source: Question with multiple answers defined just by labels.
cs: Otázka s více možnými odpověďmi definovanými pouze popisky.

source: Next
cs: Další

source: Previous
cs: Předchozí

source: Cancel
cs: Zrušit

source: Answers with values and icons
cs: Odpovědi s hodnotami a ikonami

source: Question with multiple answers, where each answer has a given label, return value, icon and tooltip.
cs: Otázka s více odpověďmi, kde má každá odpověď popisek, návratovou hodnotu, ikonu a nápovědu.

source: Proceed to the next item.
cs: Pokračovat k následující položce.

source: Return to the previous item.
cs: Vrátit se k předchozí položce.

source: Get back to the current item.
cs: Vrátit se zpět k aktuální položce.

source: Internal dialogs
cs: Interní dialogy

source: Checked item
cs: Zaškrtnutá položka

source: Unchecked item
cs: Nezaškrtnutá položka

source: Another unchecked item
cs: Další nezaškrtnutá položka

source: Processing: %d/%d
cs: Zpracovávám: %d/%d

source: Processing: %s
cs: Zpracovávám: %s

source: Operation with dialog growing on longer messages
cs: Operace se zvětšujícím se dialogem při delších zprávách

source: Indeterminate mode operation
cs: Operace v neurčitém režimu

source: Operation with no progress indication
cs: Operace bez zobrazení průběhu

source: Please wait for the operation to finish.
cs: Vyčkejte prosím na dokončení operace.

source: Encrypt and upload
cs: Zašifrovat a odeslat

source: Download and decrypt
cs: Stáhnout a rozšifrovat

source: Viewer
cs: Prohlížeč

source: Select recipient keys
cs: Vyberte klíče příjemců

source: User
cs: Uživatel

source: Area
cs: Oblast

source: Remote connection not available.
cs: Vzdálené spojení není dostupné.

source: No key selected.
cs: Nebyl vybrán žádný klíč.

source: No file selected.
cs: Nebyl vybrán žádný soubor.

source: Encryption error.
cs: Chyba šifrování.

source: Error reading file:
cs: Chyba čtení souboru:

source: No data in this row. %s
cs: Žádná data v tomto řádku. %s

source: Images
cs: Obrázky

source: All Countries
cs: Všechny země

source: Islands
cs: Ostrovy

source: Disabled Countries
cs: Zakázané země

source: Random numbers
cs: Náhodná čísla

source: Default
cs: Výchozí

source: Countries of the current continent
cs: Země aktuálního světadílu

source: Countries of the current continent (as PrintAction)
cs: Země aktuálního světadílu (jako PrintAction)

source: Template based
cs: S šablonou

source: Database template
cs: Databázová šablona

source: Iterated table
cs: Iterace nad tabulkou

source: Continent name
cs: Název kontinentu

source: Continent details
cs: Podrobnosti o kontinentu

source: Shows the details of the currently selected main table record.
cs: Zobrazuje detaily aktuálně vybraného řádku hlavního formuláře.

source: Other countries of the same continent
cs: Ostatní země stejného kontinentu

source: Displays a table of all countries from the same continent as the currently selected main form country.
cs: Zobrazuje tabulku všech zemí stejného kontinentu, jako země aktuálně vybraná v hlavním formuláři.

source: Wikipedia
cs: Wikipedie

source: Shows Wikipedia information about the currently selected country.
cs: Zobrazuje informace o aktuálně vybrané zemi z Wikipedie.

source: Function Table
cs: Tabulka nad DB funkcí

source: Fees
cs: Poplatky

source: Really print?
cs: Opravdu tisknout?

source: Document title
cs: Název dokumentu

source: Title
cs: Název

source: Printed!
cs: Vytištěno!

source: Product prices in different countries
cs: Ceny produktu v různých zemích

source: Continent
cs: Kontinent

source: Select continent to limit country selection below to given continent.
cs: Zvolte kontinent pro omezení výběru zemí na země daného kontinentu.

source: Country
cs: Země

source: Select the country. Use the radio buttons above to limit the available options to countries of given continent.
cs: Vyberte zemi. Pomocí přepínačů výše můžete omezit dostupné možnosti na země zvoleného kontinentu.

source: Product filter
cs: Filtr produktů

source: Enter a wildcard expression to filter only matching products in the codebook field below.
cs: Zadejte výraz se zástupnými znaky pro filtrování pouze odpovídajících produktů v číselníkovém poli níže.

source: Marked products only
cs: Pouze označené produkty

source: Check this checkbox if you want to filter the products in the list below to contain only marked products.
cs: Zaškrtněte toto políčko, pokud chcete omezit seznam produktů níže pouze na označené produkty.

source: Product
cs: Produkt

source: Select the product to set the price for.
cs: Vyberte produkt, pro který chcete nastavit cenu.

source: Price
cs: Cena

source: Expense
cs: Náklady

source: Apples
cs: Jablka

source: Bananas
cs: Banány

source: Oranges
cs: Pomeranče

source: Enumeration fields
cs: Výčtová políčka

source: Completion
cs: Doplňování

source: Text entry with autocompletion. The 'completer' provides available completions. As opposed to enumerator (which also provides autocompletion values), completer has no effect on validation. You can define a static (like here), dynamic or database connected list of completions.
cs: Textové pole s automatickým doplňováním. „Completer” poskytuje dostupné možnosti doplnění. Na rozdíl od enumerátoru (který také poskytuje hodnoty pro doplňování) nemá completer žádný vliv na validaci. Můžete definovat statický (jako zde), dynamický nebo databází napojený seznam doplnění.

source: Multiline
cs: Víceřádkové

source: Password
cs: Heslo

source: Password field doesn't display the current value. If 'verify' is set to True in field's type, the field requires the value to be entered twice and validation makes sure both values match.
cs: Pole pro heslo nezobrazuje aktuální hodnotu. Pokud je v typu pole nastaveno „verify” na True, vyžaduje pole zadání hodnoty dvakrát a validace ověří, že se obě hodnoty shodují.

source: Number
cs: Číslo

source: A simple numeric field.
cs: Jednoduché číselné políčko.

source: Slider
cs: Posuvník

source: Decimal
cs: Desetinné

source: Date
cs: Datum

source: Date entry field with a calendar control and a default value.
cs: Datumové políčko s kalendářovým výběrem a výchozí hodnotou.

source: Time
cs: Čas

source: Date and time
cs: Datum a čas

source: File
cs: Soubor

source: Image
cs: Obrázek

source: Color
cs: Barva

source: Check box
cs: Zaškrtávátko

source: Check/uncheck this checkbox to enable/disable all other form fields. This field demonstrates a simple boolean checkbox field. It also demonstrates how to make fields editable based on the values of some other fields (any more complicated logic is possible in the 'computer' of the 'editable' property in field specification). Finally it demonstrates how all field types look in the editable and non-editable state.
cs: Zaškrtnutím/odškrtnutím tohoto políčka povolíte/zakážete všechna ostatní políčka formuláře. Toto pole demonstruje jednoduché booleovské zaškrtávací políčko. Zároveň ukazuje, jak měnit editovatelnost polí podle hodnot jiných polí (složitější logiku lze implementovat v „computer” vlastnosti „editable” ve specifikaci pole). Nakonec ukazuje, jak jednotlivé typy polí vypadají v editovatelném a needitovatelném stavu.

source: Choice
cs: Výběr

source: Simple pull-down menu selection.
cs: Jednoduchý výběr z rozbalovací nabídky.

source: Radio box
cs: Přepínač

source: Radio box selection. The enumeration is defined statically by an Enumeration class.
cs: Výběr pomocí přepínačů. Výčet je definován staticky třídou Enumeration.

source: List box
cs: Seznam

source: List selection which becomes scrollable when the number of items exceeds its height.
cs: Výběr ze seznamu, který začne být rolovatelný, když počet položek překročí jeho výšku.

source: Codebook
cs: Číselník

source: This field provides a text entry for writing down the code directly. It most convenient when the codebook contains a relatively large number of items while their codes are short and simple. Then the user most often knows the codes without looking them up. Right from the text entry field, there is a codebook invocation button, which allows the user to select the item from a codebook form (when he doesn't remember the code or wants to see the full listing of all available items for some other reason). Further on the right, there is a gray field called `display'. It shows the description of the currently selected item (eg. the full name for the selected code). Thus it provides immediate feedback when the user modifies the value. It is empty when the entered code is invalid (not contained in the codebook). It is updated with any change of the field value.
cs: Toto pole poskytuje textový vstup pro přímé zadání kódu. Je nejpohodlnější, když číselník obsahuje relativně velké množství položek, ale jejich kódy jsou krátké a jednoduché. Uživatel pak kódy často zná bez nutnosti vyhledávání. U textového pole je tlačítko pro vyvolání číselníku, které umožňuje vybrat položku z číselníkového formuláře (když si uživatel kód nepamatuje nebo chce z nějakého důvodu vidět úplný seznam položek). Vpravo je šedé pole nazvané „display”. Zobrazuje popis aktuálně vybrané položky (např. plný název pro zvolený kód). Poskytuje tak okamžitou zpětnou vazbu při změně hodnoty. Pokud je zadaný kód neplatný (není obsažen v číselníku), pole je prázdné. Pole se aktualizuje při každé změně hodnoty.

source: List Field
cs: Seznamové pole

source: This field also allows direct codebook manipulations through the row context menu.
cs: Toto pole umožňuje také přímé úpravy číselníku přes kontextové menu řádku.

source: Numeric range
cs: Číselný rozsah

source: Date range
cs: Datumový rozsah

source: Basic fields
cs: Základní políčka

source: Range fields
cs: Rozsahová políčka

source: Codebook runtime filter demo
cs: Ukázka průběžného filtrování číselníku

source: Country name filter
cs: Filtr názvu země

source: Enter a wildcard expression to filter only matching countries in the codebook field below.
cs: Zadejte výraz se zástupnými znaky pro filtrování pouze odpovídajících zemí v číselníkovém poli níže.

source: Show only european countries
cs: Zobrazovat pouze evropské země

source: Check/uncheck this checkbox to enable/disable non-european countries in the codebook field below.
cs: Zaškrtnutím/odškrtnutím tohoto políčka povolíte/zakážete mimoevropské země v číselníkovém poli níže.

source: Lists countries filtered by the above two fields.
cs: Zobrazuje seznam zemí filtrovaných podle políček výše.

source: Group
cs: Skupina

source: Lists system user groups.
cs: Zobrazuje seznam systémových uživatelských skupin.

source: Lists users of the above selected group.
cs: Zobrazuje uživatele výše vybrané skupiny.

source: Notes
cs: Poznámky

source: Year
cs: Rok

source: Month
cs: Měsíc

source: Marked
cs: Označeno

source: Unmarked
cs: Neoznačeno

source: Date when the product was first included.
cs: Datum prvního přidání produktu.

source: Arbitrary internal notes about given product.
cs: Libovolné interní poznámky o produktu.

source: Product Page
cs: Stránka produktu

source: Product Info
cs: Informace o produktu

source: Available since
cs: Dostupné od

source: Shows web page generated from LCG structured text.
cs: Zobrazuje webovou stránku vygenerovanou z LCG strukturovaného textu.

source: Mark/unmark
cs: Označit/zrušit označení

source: Mark all
cs: Označit všechny

source: Unmark all
cs: Zrušit označení všech

source: Mark selected
cs: Označit vybrané

source: Unmark selected
cs: Zrušit označení vybraných

source: Edit marked products
cs: Upravit označené produkty

source: Print price
cs: Tisknout cenu

source: Highlight low count
cs: Zvýraznit nízký stav

source: Price with VAT
cs: Cena vč. DPH

source: Marked %d rows
cs: Označeno %d řádků

source: Unmarked %d rows
cs: Zrušeno označení %d řádků

source: Tree
cs: Strom

source: Tree ID
cs: ID stromu

source: Name
cs: Název

source: Amount
cs: Množství

source: Description
cs: Popis

source: Process selection
cs: Zpracovat výběr

source: Processing row {}: {}
cs: Zpracovávám řádek {}: {}

source: Files and URLs
cs: Soubory a URL adresy

source: Open file
cs: Otevřít soubor

source: Open URL
cs: Otevřít URL

source: Random numbers controlled by query fields
cs: Náhodná čísla ovládaná políčky dotazu

source: Row Count
cs: Počet řádků

source: Min
cs: Minimum

source: Max
cs: Maximum

source: Max must be greater than Min!
cs: Maximum musí být vyšší než minimum!

source: RangeTypes
cs: Rozsahové typy

source: Product ID
cs: ID produktu

source: Print Specification Demo
cs: Ukázka tiskové specifikace

source: Language: %s
cs: Jazyk: %s
