Repository: cerha/pytis
Catalog: translations/pytis.*.po
Languages: de, es, pl, sk

source: Yes
de: Ja
es: Sí
pl: Tak
sk: Áno

source: image
de: Bild
es: imágen
sk: obrázok

source: file
de: Datei
es: archivo
sk: súbor

source: Empty value
de: Leerer Wert
es: Valor vacío
pl: Pusta warto¶æ
sk: Prázdna hodnota

source: Invalid value
de: Ungültiger Wert
es: Valor no válido
pl: Niepoprawna warto¶æ
sk: Neplatná hodnota

source: Minimal length %(minlen)s characters not satisfied
es: No satisface la longitud mínima de %(minlen)s caracteres

source: Maximal length %(maxlen)s characters exceeded
es: Supera la longitud máxima de %(maxlen)s caracteres

source: Not an integer
de: Das ist keine ganze Zahl.
es: No es un número entero
pl: To nie jest liczba ca³kowita
sk: Nie je to celé číslo

source: Invalid number
de: Das ist eine ungültige Zahl.
es: Número no válido
pl: Niepoprawny numer
sk: Niepovolené číslo

source: String exceeds max length %(maxlen)s characters
es: Texto supera la longitud máxima de %(maxlen)s caracteres

source: Enter the password twice to eliminate typos
de: Geben Sie das Passwort doppelt ein, um Tippfehler zu eliminieren.
es: Pone la contraseña dos veces para evitar errores
sk: Zadajte heslo dvakrát pre eliminovanie preklepov

source: Passwords don't match
de: Die Kontrolleingabe des Passworts stimmt nicht überein.
es: Las contraseñas no coinciden
sk: Kontrolné zadanie hesla nezodpovedá

source: Please use mix of letters and non-letters in your password
es: Por favor, usar una mezcla de letras y números en su contraseña

source: Invalid format
de: Ungültiges Format
es: Formato no válido
pl: Niew³a¶ciwy format
sk: Neplatný formát

source: Invalid color format ('#RGB' or '#RRGGBB')
de: Farbformat stimmt nicht überein ('#RGB' oder '#RRGGBB')
es: Formato del color ('#RGB' o '#RRGGBB') no válido
pl: Niew³a¶ciwy format koloru ('#RGB' lub '#RRGGBB')
sk: Formát farby nezodpovedá ('#RGB' nebo '#RRGGBB')

source: Invalid date or time format
de: Falsches Format für Datum oder Zeit
es: Formato de fecha y/o hora no válido
pl: Niew³a¶ciwy format daty lub czasu
sk: Chybný formát dátumu alebo času

source: Invalid date or time
de: Falsches Datum oder Zeit
es: Fecha y/o hora no válida
pl: Niew³a¶ciwy format daty lub czasu
sk: Chybný dátum alebo čas

source: Date outside the allowed range
de: Datum außerhalb des zulässigen Umfangs
es: La fecha está fuera del rango permitido
pl: Data poza dopuszczalnym obrêbem
sk: Dátum mimo povolený rozsah

source: Minimal size %(minlen)s not satisfied
de: Mindestgröße nicht eingehalten %(minlen)s
es: El tamaňo mínimo %(minlen)s no satisfecho
sk: Nedodržaná minimálna veľkosť %(minlen)s

source: Maximal size %(maxlen)s exceeded
de: max. Größe %(maxlen)s überschritten
es: Tamaño máximo %(maxlen)s superado
sk: Maximálna veľkosť %(maxlen)s prekročená

source: Maximal pixel size %(maxsize)s exceeded
de: max. Größe %(maxlen)s überschritten
es: Tamaño máximo del %(maxsize)s pixeles superado
sk: Maximálny rozmer %(maxsize)s pixelov prekročený

source: Minimal pixel size %(minsize)s exceeded
de: Max. Pixelmaß %(maxsize)s überschritten
es: Tamaño mínimo de %(minsize)s pixeles superado
sk: Minimálny rozmer %(minsize)s pixelov nedodržaný

source: Unsupported format %(format)s; valid formats: %(formats)s
de: Format entspricht nicht %(format)s; gültige Formate: %(formats)s
es: Formato %(format)s no permitido; formatos válidos: %(formats)s
sk: Nepodporovaný formát %(format)s; platné formáty: %(formats)s

source: Submit
de: Senden
es: Confirmar
pl: Wy¶lij
sk: Odoslať

source: Undo all changes
de: Alle durchgeführten Änderungen zurücksetzen.
es: Descartar todas las modificaciones
sk: Zrušiť všetky urobené zmeny

source: Submit the form
de: Formular senden
es: Envia el formulario
sk: Odoslať formulár

source: Fields marked by an asterisk are mandatory.
de: Felder mit Sternchen sind Pflichtfelder.
es: Campos marcados con asterisco son obligatorios.
sk: Políčka označené hviezdičkou sú povinné.

source: Filter
es: Filtro

source: All items
es: Todos los registros

source: Actions
es: Acciones
sk: Akcie

source: No records.
de: Kein Eintrag
es: Ningún registro.
pl: Nie ma wpisu.
sk: Žiadne záznamy.

source: Total records:
de: Einträge insgesamt:
es: Registros en total:
sk: Počet záznamov celkom:

source: Displayed records %(first)s-%(last)s of total %(total)s
de: Abgebildete Einträge %(first)s-%(last)s von insgesamt %(total)s
es: Mostrados %(first)s-%(last)s registros de %(total)s en total
sk: Zobrazené záznamy %(first)s-%(last)s z celkom %(total)s

source: %(label)s on "%(prefix)s":
es: %(label)s sobre "%(prefix)s":
sk: %(label)s na "%(prefix)s":

source: Skip to the first record beginning with "%s"
de: Übersetzen Sie auf die erste Zeile beginnende an "%s":
es: Ir al primer registro que empieza con "%s"
sk: Preskočit na prvý riadok začínajúci na „%s“

source: Search expression
es: Parámetro de búsqueda

source: Search
es: Buscar

source: (Use ALT+arrow down to select)
de: (Drücken Sie ALT+Pfeil nach unten für die Auswahl)
es: (Usa ALT+flecha abajo para elegir)
sk: (použite ALT+šipka dole pre výber)

source: Page
de: Seite
es: Página
sk: Strana

source: Previous
de: vorherige
es: Anterior
sk: predchádzajúci

source: Go to previous page
de: Zurück zur vorherigen Seite des Auszugs
es: Ir a la página anterior
sk: Prejsť na predchádzajúcu stránku výpisu

source: Next
de: weiter
es: Siguiente
sk: ďalší

source: Go to next page
de: Nächsten Seite des Auszugs
es: Ir a la página siguiente
sk: Prejsť na nasledujúcu stránku výpisu

source: Records per page
de: Anzahl der Einträge pro Seite
es: Registros por página
sk: Počet záznamov na stránku

source: Go
de: Start
es: Ir
sk: Choď

source: No
de: Nein
pl: Nie
sk: Nie

source: Reset
de: Ursprungswerte wiederherstellen
pl: Od¶wie¿
sk: Vrátiť pôvodné hodnoty

source: String exceeds max length %(maxlen)d
pl: Ci±g przekracza maksymaln± d³ugo¶æ %(maxlen)d
