Repository: cerha/pytis
Catalog: translations/pytis-defs.*.po
Languages: cs

source: Languages
cs: Jazyky

source: Management of languages available in CMS.
cs: Správa jazyků dostupných v CMS.

source: Code
cs: Kód

source: Title
cs: Název

source: Modules
cs: Moduly

source: Management of extension modules available for use in pages.
cs: Správa rozšiřujících modulů použitelných ve stránkách.

source: Description
cs: Popis

source: Available actions of this module
cs: Dostupné akce tohoto modulu

source: Reload available actions
cs: Přenačíst dostupné akce

source: This module is used on existing pages. If you want to delete it, remove all linked pages first.
cs: Modul je používán v existujících stránkách. Pokud jej chcete vymazat, zrušte nejprve všechny navázané stránky.

source: Not specified
cs: Neuvedeno

source: Found actions
cs: Nalezené akce

source: Select the actions you want to make available to web users:
cs: Zaškrtněte akce, které chcete zpřístupnit webovým uživatelům:

source: Action
cs: Akce

source: View record
cs: Zobrazit záznam

source: List all records
cs: Výpis všech záznamů

source: Export table to CSV
cs: Exportuj tabulku do formátu CSV

source: Show RSS feeds
cs: Zobrazit RSS kanály

source: Insert new record
cs: Vložit nový záznam

source: Edit existing record
cs: Upravit existující záznam

source: Delete record
cs: Smazat záznam

source: Export printable fields to PDF
cs: Exportovat tisknutelná pole do PDF

source: Identifier
cs: Identifikátor

source: Module
cs: Modul

source: Management of main menu items, their hierarchy and content.
cs: Správa položek hlavního menu, jejich hierarchie a obsahu.

source: The identifier will be used as the page URL path. It may be used in links to this page within the text of other pages. A valid identifier may contain only ASCII letters, digits, hyphens and underscores, and must start with a letter.
cs: Identifikátor bude vystupovat jako vnější adresa stránky. Může být použit v odkazech na tuto stránku v rámci textu jiných stránek. Platný identifikátor může obsahovat pouze písmena bez diakritiky, číslice, pomlčky a podtržítka a musí začínat písmenem.

source: Language
cs: Jazyk

source: Menu item title - short and descriptive.
cs: Název položky menu - krátký a výstižný.

source: Heading
cs: Nadpis

source: Main heading displayed on the page. If left empty, the menu item title will be used. That title is sometimes too short because it is used in menus, so you can provide a longer variant here.
cs: Hlavní nadpis při zobrazení stránky. Pokud ponecháte nevyplněné, použije se název položky. Ten je ale někdy kvůli použití v menu příliš krátký, takže zde je možné určit jeho delší variantu.

source: Short page description (shown in menu as a tooltip).
cs: Stručný popis stránky (zobrazen v menu jako tooltip).

source: Content
cs: Obsah

source: Page text formatted as LCG structured text (wiki)
cs: Text stránky formátovaný jako LCG strukturovaný text (wiki)

source: Select an extension module displayed inside the page. Leave empty for a plain text page.
cs: Vyberte rozšiřující modul zobrazený uvnitř stránky. Ponechte prázdné pro prostou textovou stránku.

source: Parent item
cs: Nadřízená položka

source: Select the immediate parent item in the menu hierarchy. Leave empty for pages at the top level of the menu.
cs: Vyberte bezprostředně nadřízenou položku v hierarchii menu. Ponechte prázdné pro stránky na nejvyšší úrovni menu.

source: Published
cs: Zveřejněno

source: Controls availability of the item independently for each language version.
cs: Umožňuje řídit dostupnost dané položky nezávisle pro každou jazykovou verzi.

source: Ordering
cs: Pořadí

source: Enter a number denoting the order of the item in menu between pages of the same hierarchy level. Leave empty to put the item automatically to bottom.
cs: Zadejte číslo určující pořadí položky v menu (mezi stránkami na stejné úrovni hierarchie). Pokud nevyplníte, stránka bude automaticky zařazena na konec.

source: An item cannot be its own parent.
cs: Položka nemůže být nadřízená sama sobě.

source: Cannot assign a child item as a parent (cycle in the hierarchy).
cs: Nelze přiřadit podřízenou položku jako nadřízenou (cyklus v hierarchii).

source: Another item at this menu level already has the same order number.
cs: Stejné pořadové číslo už má jiná položka na této úrovni menu.

source: This item has child items. If you want to delete it, delete all child items first.
cs: Položka má podřízené položky. Pokud ji chcete vymazat, vymažte nejprve všechny podpoložky.

source: Global properties (shared by all languages)
cs: Globální vlastnosti (společné pro všechny jazyky)

source: Page text (for the current language version)
cs: Text stránky (pro aktuální jazykovou verzi)

source: Access rights
cs: Přístupová práva

source: Error accessing attachment storage: %s
cs: Chyba přístupu k úložišti příloh: %s

source: Users
cs: Uživatelé

source: Management of user accounts, which can then be assigned to roles.
cs: Správa uživatelských účtů, které je poté možno zařazovat do rolí.

source: Username
cs: Přihlašovací jméno

source: Full name
cs: Celé jméno

source: Password
cs: Heslo

source: User roles
cs: Uživatelské role

source: Login history
cs: Historie přihlášení

source: Management of available user roles, which can be assigned to users.
cs: Správa dostupných uživatelských rolí, které je možné přiřazovat uživatelům.

source: System role
cs: Systémová role

source: Users assigned to this role
cs: Uživatelé zařazení do této role

source: System roles
cs: Systémové role

source: System roles are assigned to users automatically.
cs: Systémové role jsou uživatelům přiřazeny automaticky.

source: Roles
cs: Role

source: Roles available for assigning action permissions (includes both system and user-defined roles).
cs: Role dostupné pro přiřazování práv akcím (obsahuje systémové i uživatelsky definované role).

source: User role assignments
cs: Přiřazení uživatelských rolí

source: Management of user role assignments for individual users.
cs: Správa přiřazení uživatelských rolí jednotlivým uživatelům.

source: Role name
cs: Název role

source: Management of user assignments for individual user roles.
cs: Správa přiřazení uživatelů jednotlivým uživatelským rolím.

source: Available actions
cs: Dostupné akce

source: List of supported actions for individual modules.
cs: Výčet podporovaných akcí pro jednotlivé moduly.

source: Actions common to all menu items
cs: Akce společné pro všechny položky menu

source: List of supported actions common to all menu items.
cs: Výčet podporovaných akcí společných pro všechny položky menu.

source: Assignment of module action permissions for individual user roles.
cs: Přiřazení práv k akcím modulů pro jednotlivé uživatelské role.

source: Action Name
cs: Název akce

source: IP address
cs: IP adresa

source: User agent
cs: Prohlížeč

source: Referrer
cs: Referer

source: Unknown
cs: Neznámý

source: Login log
cs: Log přihlášení

source: Log of information about user logins to the web.
cs: Záznam informací o přihlášení uživatelů k webu.

source: Name
cs: Jméno

source: Success
cs: Úspěch

source: Start
cs: Začátek

source: Duration
cs: Trvání

source: Active
cs: Aktivní

source: Access log
cs: Log přístupů

source: Log of information about user access to individual web pages/modules.
cs: Záznam informací o přístupu uživatelů k jednotlivým stránkám/modulům webu.

source: Date and time
cs: Datum a čas

source: Path
cs: Cesta

source: User
cs: Uživatel

source: Color themes
cs: Barevné motivy

source: Management of color themes.
cs: Správa barevných motivů.

source: Foreground color of the main content areas.
cs: Barva popředí hlavních obsahových ploch.

source: Background
cs: Pozadí

source: Background color of the main content areas (page body text, panels).
cs: Barva pozadí hlavních obsahových ploch (vlastní text stránky, panely).

source: Highlight background
cs: Zvýrazněné pozadí

source: Background-color highlighting can be used in various places, e.g. to distinguish the current menu item, the current language, a record found in a form, etc.
cs: Zvýraznění pomocí barvy pozadí může být použito na různých místech, např. pro odlišení aktuální položky menu, aktuálního jazyka, nalezeného záznamu ve formuláři apod.

source: Link
cs: Odkaz

source: Text color of an unvisited link.
cs: Barva textu nenavštíveného odkazu.

source: Visited link
cs: Navštívený odkaz

source: Text color of a visited link. If left empty, the same color as for an unvisited link will be used.
cs: Barva textu navštíveného odkazu. Pokud ponecháte prázdné, bude použita stejná barva jako u nenavštíveného odkazu.

source: Hover link
cs: Aktivní odkaz

source: Link color on mouse hover. If left empty, the link will not react to mouse hover.
cs: Obarvení odkazu při pohybu myší nad ním. Pokud ponecháte prázdné, nebude odkaz na pohyb myši reagovat.

source: Border
cs: Orámování

source: Heading colors are used to highlight titles of chapters, panels, and other elements that act as headings. Depending on the styles used, some heading types may use a different background color, while others may be underlined only (see below). The text color is shared for both heading types.
cs: Barvy nadpisů jsou používány pro zvýraznění názvů kapitol, panelů a jiných elementů majících povahu nadpisu či záhlaví. V závislosti na použitých stylech mohou některé typy nadpisů používat odlišnou barvu pozadí, jiné mohou být pouze podtrženy (viz dále). Barva textu je však společná pro oba typy nadpisů.

source: Background color for headings that use background-color highlighting. Typically these are headers of page sections (menu, panels, etc.) and higher-level headings.
cs: Barva pozadí pro nadpisy, které používají zvýraznění barvou pozadí. Typicky jsou to záhlaví částí stránky (menu, panely apod.) a nadpisy vyšších úrovní.

source: Underline
cs: Podtržení

source: Underline color for headings that use underlining for emphasis. Typically these are lower-level headings.
cs: Barva podtržení pro nadpisy, které používají zvýraznění podtržením. Typicky jsou to nadpisy nižších úrovní.

source: Frames are generally used to distinguish standalone page elements such as forms, toolbars, indexes, etc. Frames in this sense have nothing to do with HTML frames. If you leave the text color empty, the default text color will be used (often you will want to set only the background and border for frames).
cs: Rámy jsou obecně využívány pro odlišení samostatných prvků stránky, jako jsou například formuláře, nástrojové lišty, rejstříky apod. Rámy v tomto smyslu nemají nic splečného s HTML rámy (frame). Pokud barvu textu nevyplníte, bude použita standardní barva textu (často u rámů budete chtít nastavit pouze barvu pozadí a orámování).

source: Background color of frames to visually distinguish them from the rest of the page content.
cs: Barva pozadí rámů pro jejich vizuální odlišení od ostatního obsahu stránky.

source: Border color of the frame area at the transition between the frame background and its underlying area.
cs: Barva orámování okrajů plochy rámu na přechodu mezi barvou pozadí rámu a jeho podkladem.

source: Text usually does not appear directly on background areas, but some styles may require it.
cs: Na podkladových plochách se většinou text přímo nevyskytuje, ale některé styly to mohou předepisovat.

source: Background areas form the surroundings of the main page content and panels.
cs: Podkladové plochy tvoří okolí hlavního obsahu stránky a panelů.

source: Specifies the border color at the transition between the background area and the content parts of the page.
cs: Určuje barvu rámečku na přechodu mezi podkladovou plochou a obsahovými částmi stránky.

source: Highlighting of the informational line in detail views, e.g. date and author information in an article list.
cs: Odlišení informačního řádku v detailních výpisech, jako např. informace o datu a autorovi v seznamu článků.

source: Default cell background
cs: Standardní pozadí buňky

source: Shaded cell background
cs: Stínované pozadí buňky

source: Form help
cs: Nápověda formuláře

source: Inactive tab
cs: Neaktivní záložka

source: Standard page colors
cs: Standardní barvy stránky

source: Tables
cs: Tabulky

source: Miscellaneous
cs: Různé

source: Heading colors
cs: Barvy nadpisů

source: Frames
cs: Rámy

source: Record metadata
cs: Metadata záznamu

source: Background area colors
cs: Barvy podkladových ploch

source: Error messages
cs: Chybové zprávy

source: Informational messages
cs: Informační zprávy

source: Default
cs: Výchozí

source: During inline editing
cs: Během řádkové editace

source: Inactive form
cs: Neaktivní formulář

source: Border width
cs: Šířka okraje

source: Current cell highlight
cs: Zvýraznění aktuální buňky

source: Table grid
cs: Mřížka tabulky

source: Grouping background change
cs: Změna pozadí při seskupení

source: Show start-up dialog
cs: Zobrazovat úvodní dialog

source: Show tooltips
cs: Zobrazovat tooltipy

source: Automatically numbered menus with accelerator keys
cs: Automaticky číslovaná menu s klávesovými zkratkami

source: Automatically stretch tables to full window width
cs: Automaticky roztáhnout tabulky na celou šířku okna

source: E-mail address
cs: E-mailová adresa

source: Character encoding
cs: Kódování znaků

source: User interface settings
cs: Nastavení uživatelského rozhraní

source: Colors
cs: Barvy

source: Current table row highlight
cs: Zvýraznění aktuálního řádku tabulky

source: Behavior
cs: Chování

source: Other
cs: Ostatní

source: Export settings
cs: Nastavení exportu

source: Change administrator password
cs: Změna administrátorského hesla

source: Current password
cs: Stávající heslo

source: New password
cs: Nové heslo

source: Please use a combination of lowercase and uppercase letters and digits.
cs: Použijte, prosím, kombinaci malých a velkých znaků a číslic.

source: Encryption areas
cs: Šifrovací oblasti

source: Administrator key for this area was not found
cs: Nebyl nalezen klíč administrátora pro tuto oblast

source: Incorrect password
cs: Chybné heslo

source: Failed to change password
cs: Heslo se změnit nepodařilo

source: Password has been changed
cs: Heslo bylo změněno

source: Logged-in user's password
cs: Heslo přihlášeného uživatele

source: Administrator e-mail address
cs: E-mailová adresa administrátora

source: New password for user
cs: Nové heslo pro uživatele

source: Generate password
cs: Generovat heslo

source: Clear password
cs: Zrušit heslo

source: New encrypted area user
cs: Nový uživatel šifrované oblasti

source: Key for this area was not found
cs: Nebyl nalezen klíč pro tuto oblast

source: Users can only be added or removed
cs: Uživatele lze jen přidávat a odebírat

source: Administrators cannot be deleted
cs: Administrátory mazat nelze

source: Help
cs: Nápověda

source: Specification Name
cs: Název specifikace

source: Menu item description
cs: Popis položky menu

source: Brief form description
cs: Stručný popis náhledu

source: Detailed form help
cs: Podrobná nápověda náhledu

source: Choose the directly superordinate item in menu hierarchy. Leave empty for pages at the top level menu.
cs: Vyberte bezprostředně nadřízenou položku v hierarchii menu. Ponechte prázdné pro stránky na nejvyšší úrovni menu.

source: Removed
cs: Zrušeno

source: Changed
cs: Změněno

source: Fields
cs: Políčka

source: Profiles
cs: Profily

source: Actions
cs: Akce

source: Side Forms
cs: Vedlejší formuláře

source: This item has no editable help.
cs: Tato položka nemá editovatelnou nápovědu.

source: User Actions Log
cs: Log uživatelských akcí

source: Time
cs: Čas

source: Form Class
cs: Třída formuláře

source: Overview of Changes
cs: Přehled změn

source: From
cs: Od

source: To
cs: Do

source: Table
cs: Tabulka

source: Key
cs: Klíč

source: Row contains
cs: Řádek obsahuje

source: Schema
cs: Schéma

source: Operation
cs: Operace

source: Key column ID
cs: ID klíč

source: Row
cs: Řádek

source: Role Purposes
cs: Účely rolí

source: Administrator roles cannot be edited
cs: Správcovské role nelze editovat

source: Administrator roles cannot be deleted
cs: Správcovské role nelze mazat

source: Do you really want to delete this record permanently?
cs: Opravdu chcete záznam zcela vymazat?

source: Group
cs: Skupina

source: Included Role
cs: Obsažená role

source: A short role name or database username.
cs: Stručný název role nebo uživatelské jméno v databázi.

source: Role description.
cs: Popis určení role.

source: Purpose
cs: Účel

source: Role purpose: normal, user account, administrator.
cs: Účel role: normální, uživatelský účet, správcovská.

source: Purpose meaning: normal, user account, administrator.
cs: Význam role: normální, uživatelský účet, správcovská.

source: Deactivation Date
cs: Datum zrušení

source: If set, the role is inactive from that date.
cs: Je-li nastaveno, role je od daného data neaktivní.

source: Active roles
cs: Nezrušené role

source: Copy roles from...
cs: Zkopírovat role od...

source: Configure application roles based on another user.
cs: Nastavení aplikačních rolí dle jiného uživatele.

source: Contains roles
cs: Obsahuje role

source: Belongs to roles
cs: Patří do rolí

source: Menu preview
cs: Náhled menu

source: Preview of pending menu
cs: Náhled chystaného menu

source: Extended menu preview
cs: Rozšířený náhled menu

source: Preview of pending extended menu
cs: Rozšířený náhled chystaného menu

source: Roles cannot be deleted; set the deactivation date.
cs: Role nelze mazat, nastavte datum zrušení.

source: Role membership
cs: Členství v rolích

source: A role that contains other roles.
cs: Role, do níž jsou zahrnuty jiné role.

source: A role that is a member of the group role.
cs: Role, která je členem skupinové role.

source: Role purpose identifier
cs: Identifikátor účelu role

source: Role memberships cannot be edited; only added or deleted.
cs: Přiřazení rolí nelze editovat, jen přidávat a mazat.

source: Group membership
cs: Zařazení do skupiny

source: Role assignment
cs: Přiřazení role

source: User Actions
cs: Uživatelské akce

source: Attached action
cs: Navěšená akce

source: ID containing roles
cs: ID obsahující role

source: Base menu item title
cs: Základní titulek položky menu

source: Derived menu item title
cs: Odvozený titulek položky menu

source: Translated menu item title
cs: Přeložený titulek položky menu

source: Menu item title
cs: Titulek položky menu

source: Menu position
cs: Pozice v menu

source: Next menu position
cs: Následující pozice v menu

source: Number of child nodes
cs: Počet poduzlů

source: Application action triggered by the menu item
cs: Akce aplikace vyvolaná položkou menu

source: Locked
cs: Zákaz editace

source: Outdated translation
cs: Neaktuální překlad

source: This menu item cannot be edited
cs: Tuto položku menu nelze editovat

source: This menu item cannot be deleted
cs: Tuto položku menu nelze smazat

source: Leaf menu items cannot be deleted
cs: Koncové položky menu nelze mazat

source: Cannot delete items that contain other items
cs: Nelze mazat položky obsahující jiné položky

source: Item type
cs: Typ položky

source: Note
cs: Poznámka

source: Rights breakdown by roles
cs: Rozpis práv podle rolí

source: Rights breakdown by columns
cs: Rozpis práv podle sloupců

source: Menu item rights
cs: Práva položky menu

source: Pending menu item rights
cs: Chystaná práva položky

source: Pending changes
cs: Chystané změny

source: Settings
cs: Nastavení

source: Copy rights from...
cs: Zkopírovat práva z...

source: Copy permissions from another item.
cs: Zkopírování práv z jiné položky.

source: Remove redundant rights
cs: Odstranit nadbytečná práva

source: Remove permission entries that have no effect on the resulting permissions.
cs: Odstranění položek práv, které nemají vliv na výsledná práva.

source: This specification is missing these rights columns: %s. Do you want to copy the rights anyway?
cs: Ve specifikaci chybí tyto sloupce práv: %s. Chcete práva přesto zkopírovat?

source: Do you really want to remove redundant rights for the item "%s"?
cs: Opravdu chcete odstranit nadbytečná práva položky "%s"?

source: Rights list
cs: Seznam práv

source: Right
cs: Právo

source: Columns
cs: Sloupce

source: Warning, this item also appears elsewhere in the menu:
cs: Pozor, tato položka se vyskytuje i na jiných místech menu:

source: [no title]
cs: [bez titulku]

source: Contradictory codebook access rights.
cs: Rozporuplná přístupová práva k číselníku.

source: Rights
cs: Práva

source: Identifier of the action associated with this menu item
cs: Identifikátor akce související s danou položkou menu

source: Column
cs: Sloupec

source: The column the right applies to
cs: Sloupec, na který se právo vztahuje

source: The granted or revoked right
cs: Přidělené nebo odebrané právo

source: System
cs: Systémové

source: Is this an immutable right defined by the application author?
cs: Jde o neměnné právo definováno tvůrcem aplikace?

source: Yes/No
cs: Ano/Ne

source: Is the right granted (yes) or denied (no)?
cs: Je právo povoleno (ano) nebo zakázáno (ne)?

source: Redundant
cs: Nadbytečné

source: Is this right redundant, without effect on the resulting rights?
cs: Je toto právo nadbytečné, bez vlivu na výsledná práva?

source: System rights cannot be edited
cs: Systémová práva nelze editovat

source: System rights cannot be deleted
cs: Systémová práva nelze mazat

source: Failed to delete the row.
cs: Řádek se nepodařilo vymazat.

source: Changes applied
cs: Změny aplikovány

source: Applying changes is locked; changes were not applied
cs: Provádění změn uzamčeno, změny nebyly aplikovány

source: Tree identifier
cs: Stromový identifikátor

source: Summary rights
cs: Souhrnná práva

source: Columns the right applies to; if empty, all columns.
cs: Sloupce, na které je právo aplikováno; není-li uvedeno, tak všechny.

source: Show in menu
cs: Zobrazení v menu

source: View
cs: Zobraz

source: View the form
cs: Zobraz formulář

source: Insert
cs: Vlož

source: Insert a new record
cs: Vlož nový záznam

source: Update
cs: Uprav

source: Update an existing record
cs: Uprav existující záznam

source: Delete
cs: Smaž

source: Delete an existing record
cs: Smaž existující záznam

source: Print
cs: Vytiskni

source: Print the form
cs: Vytiskni formulář

source: Export
cs: Exportuj

source: Export the form to a file
cs: Exportuj formulář do souboru

source: Run
cs: Spusť

source: Run a function (not applicable to forms)
cs: Spuštění funkce (netýká se formulářů)

source: Pending rights
cs: Chystaná práva

source: Pending rights changes
cs: Chystané změny práv

source: New
cs: Nové

source: User menu
cs: Menu uživatele

source: Menu item identifier
cs: Identifikátor položky menu

source: Pending user menu
cs: Chystané menu uživatele

source: Extended user menu
cs: Rozšířené menu uživatele

source: Pending extended user menu
cs: Chystané rozšířené menu uživatele

source: Predefined print templates
cs: Předdefinované tiskové šablony

source: Row identifier
cs: Identifikátor řádku

source: Form
cs: Formulář

source: Template name
cs: Název šablony

source: Template
cs: Šablona

source: Row template
cs: Šablona pro jednotlivé řádky

source: User print templates
cs: Uživatelské tiskové šablony

source: Header
cs: Hlavička

source: First-page header (different)
cs: Odlišná hlavička první stránky

source: Footer
cs: Patička

source: Style
cs: Styl

source: Headers and footers
cs: Hlavičky a patičky

source: You can delete only your own records.
cs: Můžete mazat pouze své vlastní záznamy.

source: Do you really want to delete the print report %s?
cs: Opravdu chcete vymazat tiskovou sestavu %s?

source: This template name already exists
cs: Tento název šablony již existuje

source: Print report does not exist:
cs: Tisková sestava neexistuje:

source: Print report exists in multiple copies:
cs: Tisková sestava se vyskytuje ve více exemplářích:
