Repository: cerha/pytis
Catalog: translations/pytis-x2goclient.*.po
Languages: cs

source: Login name:
cs: Uživatelské jméno:

source: Existing sessions:
cs: Existující sezení:

source: Resume
cs: Obnovit

source: Terminate
cs: Ukončit

source: Passphrase:
cs: Heslo:

source: Trying password or public key authentication.
cs: Zkouším autentizaci heslem nebo veřejným klíčem.

source: Public Key
cs: Veřejný klíč

source: Trying public key authentication.
cs: Zkouším autentizaci veřejným klíčem.

source: Trying password authentication.
cs: Zkouším autentizaci heslem.

source: Log in
cs: Přihlášení

source: Cancel
cs: Zrušit

source: Starting application
cs: Start aplikace

source: Trying Kerberos authentication.
cs: Zkouším autentizaci přes Kerberos.

source: Trying SSH Agent authentication.
cs: Zkouším autentizaci pomocí SSH agenta.

source: User name
cs: Uživatelské jméno

source: Initializing libraries. Please wait...
cs: Inicializace knihoven. Vyčkejte prosím...

source: Initializing application. Please wait...
cs: Inicializace aplikace. Vyčkejte prosím...

source: Invalid broker address
cs: Chybná adresa brokeru

source: Unsupported broker protocol
cs: Nepodporovaný protokol pro přístup na broker

source: Invalid session format
cs: Chybný formát sezení

source: Client setup. Please wait...
cs: Nastavení klienta. Vyčkejte prosím...

source: Checking for new client version. Please wait...
cs: Kontrola nové verze klienta. Vyčkejte prosím...

source: New pytis client version available. Current version: {} New version: {} Install?
cs: Je dostupná nová verze klienta Pytis. Aktuální verze: {} Nová verze: {} Nainstalovat?

source: Checking sessions and profiles. Please wait...
cs: Načítání sezení a profilů. Vyčkejte prosím...

source: Select session
cs: Vyberte sezení

source: No session selected.
cs: Nebylo vybráno žádné sezení.

source: Opening selected profile. Please wait...
cs: Otevírání zvoleného profilu. Vyčkejte prosím...

source: Couldn't connect to application server %s.
cs: Nelze se připojit na aplikační server %s.

source: Checking desktop shortcut. Please wait...
cs: Kontrola zástupců na ploše. Vyčkejte prosím...

source: No free port found for RPyC in the range %s-%s
cs: Nenalezen volný port pro RPyC v rozsahu %s-%s

source: Starting server connections. Please wait...
cs: Start spojení na server. Vyčkejte prosím...

source: Password key for %s
cs: Heslo ke klíči v souboru %s

source: Login using password
cs: Přihlášení heslem

source: Login using a key file
cs: Přihlášení klíčem

source: Default authentication failed
cs: Výchozí autentizace selhala

source: No supported ssh connection method available
cs: Není dostupná žádná metoda spojení přes ssh

source: Login password
cs: Přihlášovací heslo

source: Select ssh key file
cs: Vyberte ssh klíč

source: Program error
cs: Chyba programu

source: Couldn't connect to upgrade server
cs: Nelze se připojit na aktualizační server

source: Package unpacking failed
cs: Selhalo rozbalení balíku

source: Pytis successfully upgraded. Restart the application.
cs: Pytis byl úspěšně aktualizován. Restartujte aplikaci.

source: Creating new session. Please wait...
cs: Vytváření nového sezení. Vyčkejte prosím...

source: Setting up new session. Please wait...
cs: Nastavování nového sezení. Vyčkejte prosím...

source: New session
cs: Nové sezení

source: OK
cs: Budiž

source: Resume session
cs: Obnova sezení

source: Create desktop shortcut for this session profile?
cs: Vytvořit pro tento profil ikonu na ploše?

source: Shortcut %s allready exists. Please, rename it:
cs: Zástupce %s již existuje. Zvolte jiné jméno:

source: Edit shortcut name
cs: Upravit jméno zástupce

source: Authenticating. Please wait...
cs: Autentizace. Vyčkejte prosím...

source: Launching application. Please wait...
cs: Spouštění aplikace. Vyčkejte prosím...
